Task:
Packet Tracer Install Ubuntu
Decision:
$ sudo virsh start ubuntu22.04
$ ssh -X user@IpAddrUbuntu
$ google-chrome https://www.google.ru/search?q=cisco+account+create&newwindow=1&source=hp&ei=Z8eqYdOSEcTIrgSIwIeQDQ&iflsig=ALs-wAMAAAAAYarVd9Qob1A5NSTfBETDiQsuP3G5I7gv&ved=0ahUKEwiT4p6Jgsn0AhVEpIsKHQjgAdIQ4dUDCAY&uact=5&oq=cisco+account+create&gs_lcp=Cgdnd3Mtd2l6EAMyBQgAEIAEMgUIABCABDIGCAAQFhAeMgYIABAWEB4yBggAEBYQHjIGCAAQFhAeMgYIABAWEB4yBggAEBYQHjIGCAAQFhAeMgYIABAWEB5QAFgAYPgEaABwAHgAgAGBAYgBgQGSAQMwLjGYAQCgAQKgAQE&sclient=gws-wiz &
$ google-chrome https://id.cisco.com/signin/register &
$ google-chrome https://temp-mail.org/ &
xanaveb196@simdpi.com - https://id.cisco.com/signin/register - mail: xanaveb196@simdpi.com - https://temp-mail.org/ - 
Активировать Аккаунт - https://id.cisco.com/signin/register - xanaveb196@simdpi.com
$ google-chrome https://www.google.ru/search?q=netacad+introduction+to+packet+tracer&newwindow=1&ei=Ks-qYZugA5a_rgTF_beoDw&oq=netacad+into+to+pa&gs_lcp=Cgdnd3Mtd2l6EAMYAjIGCAAQFhAeMgYIABAWEB4yBggAEBYQHjoHCAAQRxCwAzoNCC4QxwEQ0QMQsAMQQzoHCAAQsAMQQzoFCAAQgAQ6BQghEKABOgUIABDNAkoFCDwSATJKBAhBGABKBAhGGABQ96cZWMXDGWC44RloAnACeACAAZwBiAHGCpIBBDAuMTCYAQCgAQHIAQrAAQE&sclient=gws-wiz &
$ google-chrome https://www.netacad.com/portal/resources/packet-tracer &
$ wget https://www.netacad.com/portal/resources/file/71b29477-0abb-4a52-97eb-cc23d5771574
$ ls
CiscoPacketTracer_821_Ubuntu_64bit.deb
$ sudo dpkg -i CiscoPacketTracer_821_Ubuntu_64bit.deb
...
dpkg: error processing package packettracer (--install):
 dependency problems - leaving unconfigured
...
Errors were encountered while processing:
 packettracer
$ sudo apt install -f
$ sudo dpkg -i CiscoPacketTracer_821_Ubuntu_64bit.deb
$ packettracer &
Task:
The simplest network
Для организации простейшей сети потребуется Два компьютера и Патч-корд. В случае отсутствия патч-корда
необходимы: Кусок витой пары, Два коннектора RJ45.
Decision:
end devices - PC0 - PC1 - connections - copper cross-cover - PC0 - Desktop - ip configuration - ipv4 - 192.168.1.1 - subnet mask - 255.255.255.0 - PC1 - Desktop - ip configuration - ipv4 - 192.168.1.2 - subnet mask - 255.255.255.0 - PC0 - Desktop - Command Prompt
C:\>ping 192.168.1.2
    Pinging 192.168.1.2 with 32 bytes of data:
    Reply from 192.168.1.2: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.2: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.2: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.2: bytes=32 time<1ms TTL=128
    Ping statistics for 192.168.1.2:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 0ms, Average = 0ms
Task:
We have a router, a switch, 2 computers and a server that acts as a tftp server.
Task:
Проверим какая версия прошивки у коммутатора
Decision:
    switch0-CLI
Switch>en
Switch#show ver
    Cisco IOS Software, C2960 Software (C2960-LANBASE-M), Version 12.2(25)FX, RELEASE SOFTWARE (fc1)
    Copyright (c) 1986-2005 by Cisco Systems, Inc.
    Compiled Wed 12-Oct-05 22:05 by pt_team
    ROM: C2960 Boot Loader (C2960-HBOOT-M) Version 12.2(25r)FX, RELEASE SOFTWARE (fc4)
    System returned to ROM by power-on
    Cisco WS-C2960-24TT (RC32300) processor (revision C0) with 21039K bytes of memory.
    24 FastEthernet/IEEE 802.3 interface(s)
    2 Gigabit Ethernet/IEEE 802.3 interface(s)
    63488K bytes of flash-simulated non-volatile configuration memory.
    Base ethernet MAC Address       : 0090.2B80.9BA3
    Motherboard assembly number     : 73-9832-06
    Power supply part number        : 341-0097-02
    Motherboard serial number       : FOC103248MJ
    Power supply serial number      : DCA102133JA
    Model revision number           : B0
    Motherboard revision number     : C0
    Model number                    : WS-C2960-24TT
    System serial number            : FOC1033Z1EY
Switch#reload
    Proceed with reload? [confirm]
    C2960 Boot Loader (C2960-HBOOT-M) Version 12.2(25r)FX, RELEASE SOFTWARE (fc4)
    Cisco WS-C2960-24TT (RC32300) processor (revision C0) with 21039K bytes of memory.
    2960-24TT starting...
    Base ethernet MAC Address: 0090.2B80.9BA3
    Xmodem file system is available.
    Initializing Flash...
    flashfs[0]: 1 files, 0 directories
    flashfs[0]: 0 orphaned files, 0 orphaned directories
    flashfs[0]: Total bytes: 64016384
    flashfs[0]: Bytes used: 4414921
    flashfs[0]: Bytes available: 59601463
    flashfs[0]: flashfs fsck took 1 seconds.
    ...done Initializing Flash.
    Boot Sector Filesystem (bs:) installed, fsid: 3
    Parameter Block Filesystem (pb:) installed, fsid: 4
    Loading "flash:/c2960-lanbase-mz.122-25.FX.bin"...
    ...
Switch#show flash:
    Directory of flash:/
        1  -rw-     4414921          <no date>  c2960-lanbase-mz.122-25.FX.bin
    64016384 bytes total (59601463 bytes free)
Task:
Обновим прошивку
Decision:
    Server-Services-tftp
    c2960-lanbasek9-mz.150-2.SE4.bin
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int vlan 1
Switch(config-if)#ip add
Switch(config-if)#ip address 192.168.1.5 255.255.255.0
Switch(config-if)#no shut
Switch(config-if)#no shutdown
Switch(config-if)#
    %LINK-5-CHANGED: Interface Vlan1, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
Switch(config-if)#exit
Switch(config)#exit
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#ping 192.168.1.4
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 192.168.1.4, timeout is 2 seconds:
    .!!!!
    Success rate is 80 percent (4/5), round-trip min/avg/max = 0/0/0 ms
Switch#copy ?
      flash:          Copy from flash: file system
      ftp:            Copy from ftp: file system
      running-config  Copy from current system configuration
      scp:            Copy from scp: file system
      startup-config  Copy from startup configuration
      tftp:           Copy from tftp: file system
Switch#copy tf
Switch#copy tftp: ?
      flash:          Copy to flash: file system
      running-config  Copy configuration from system
      startup-config  Copy startup configuration from system
Switch#copy tftp: fl
Switch#copy tftp: flash:
    Address or name of remote host []? 192.168.1.4
    Source filename []? c2960-lanbasek9-mz.150-2.SE4.bin
    Destination filename [c2960-lanbasek9-mz.150-2.SE4.bin]?
    Accessing tftp://192.168.1.4/c2960-lanbasek9-mz.150-2.SE4.bin...
    Loading c2960-lanbasek9-mz.150-2.SE4.bin from 192.168.1.4: !!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
    [OK - 4670455 bytes]
    4670455 bytes copied in 0.244 secs (1538884 bytes/sec)
    Switch#show flash
    Directory of flash:/
        1  -rw-     4414921          <no date>  c2960-lanbase-mz.122-25.FX.bin
        4  -rw-     4670455          <no date>  c2960-lanbasek9-mz.150-2.SE4.bin
    64016384 bytes total (54931008 bytes free)
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#boot syste
Switch(config)#boot system ?
      WORD  pathlist of boot file(s) ... file1;file2;...
Switch(config)#boot system fl
Switch(config)#boot system flash:/c2960-lanbasek9-mz.150-2.SE4.bin
Switch(config)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]
Switch#reload
    Proceed with reload? [confirm]
    C2960 Boot Loader (C2960-HBOOT-M) Version 12.2(25r)FX, RELEASE SOFTWARE (fc4)
    Cisco WS-C2960-24TT (RC32300) processor (revision C0) with 21039K bytes of memory.
    2960-24TT starting...
    Base ethernet MAC Address: 0090.2B80.9BA3
    Xmodem file system is available.
    Initializing Flash...
    flashfs[0]: 3 files, 0 directories
    flashfs[0]: 0 orphaned files, 0 orphaned directories
    flashfs[0]: Total bytes: 64016384
    flashfs[0]: Bytes used: 9086469
    flashfs[0]: Bytes available: 54929915
    flashfs[0]: flashfs fsck took 1 seconds.
    ...done Initializing Flash.
    Boot Sector Filesystem (bs:) installed, fsid: 3
    Parameter Block Filesystem (pb:) installed, fsid: 4
    Loading "flash:/c2960-lanbasek9-mz.150-2.SE4.bin"...
    ########################################################################## [OK]
    Smart Init is enabled
    smart init is sizing iomem
                      TYPE      MEMORY_REQ
                    TOTAL:      0x00000000
    Rounded IOMEM up to: 0Mb.
    Using 6 percent iomem. [0Mb/512Mb]
    C2960 Boot Loader (C2960-HBOOT-M) Version 12.2(25r)FX, RELEASE SOFTWARE (fc4)
    Cisco WS-C2960-24TT (RC32300) processor (revision C0) with 21039K bytes of memory.
    2960-24TT starting...
    Base ethernet MAC Address: 0090.2B80.9BA3
    Xmodem file system is available.
    Initializing Flash...
    flashfs[0]: 3 files, 0 directories
    flashfs[0]: 0 orphaned files, 0 orphaned directories
    flashfs[0]: Total bytes: 64016384
    flashfs[0]: Bytes used: 9086469
    flashfs[0]: Bytes available: 54929915
    flashfs[0]: flashfs fsck took 1 seconds.
    ...done Initializing Flash.
    Boot Sector Filesystem (bs:) installed, fsid: 3
    Parameter Block Filesystem (pb:) installed, fsid: 4
    Loading "flash:/c2960-lanbasek9-mz.150-2.SE4.bin"...
    ########################################################################## [OK]
    Smart Init is enabled
    smart init is sizing iomem
                      TYPE      MEMORY_REQ
                    TOTAL:      0x00000000
    Rounded IOMEM up to: 0Mb.
    Using 6 percent iomem. [0Mb/512Mb]
                  Restricted Rights Legend
    Use, duplication, or disclosure by the Government is
    subject to restrictions as set forth in subparagraph
    (c) of the Commercial Computer Software - Restricted
    Rights clause at FAR sec. 52.227-19 and subparagraph
    (c) (1) (ii) of the Rights in Technical Data and Computer
    Software clause at DFARS sec. 252.227-7013.
               cisco Systems, Inc.
               170 West Tasman Drive
               San Jose, California 95134-1706
    Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 15.0(2)SE4, RELEASE SOFTWARE (fc1)
    Technical Support: http://www.cisco.com/techsupport
    Copyright (c) 1986-2013 by Cisco Systems, Inc.
    Compiled Wed 26-Jun-13 02:49 by mnguyen
    Initializing flashfs...
    fsck: Disable shadow buffering due to heap fragmentation.
    flashfs[2]: 2 files, 1 directories
    flashfs[2]: 0 orphaned files, 0 orphaned directories
    flashfs[2]: Total bytes: 32514048
    flashfs[2]: Bytes used: 11952128
    flashfs[2]: Bytes available: 20561920
    flashfs[2]: flashfs fsck took 2 seconds.
    flashfs[2]: Initialization complete....done Initializing flashfs.
    Checking for Bootloader upgrade..
    Boot Loader upgrade not required (Stage 2)
    POST: CPU MIC register Tests : Begin
    POST: CPU MIC register Tests : End, Status Passed
    POST: PortASIC Memory Tests : Begin
    POST: PortASIC Memory Tests : End, Status Passed
    POST: CPU MIC interface Loopback Tests : Begin
    POST: CPU MIC interface Loopback Tests : End, Status Passed
    POST: PortASIC RingLoopback Tests : Begin
    POST: PortASIC RingLoopback Tests : End, Status Passed
    POST: PortASIC CAM Subsystem Tests : Begin
    POST: PortASIC CAM Subsystem Tests : End, Status Passed
    POST: PortASIC Port Loopback Tests : Begin
    POST: PortASIC Port Loopback Tests : End, Status Passed
    Waiting for Port download...Complete
    This product contains cryptographic features and is subject to United
    States and local country laws governing import, export, transfer and
    use. Delivery of Cisco cryptographic products does not imply
    third-party authority to import, export, distribute or use encryption.
    Importers, exporters, distributors and users are responsible for
    compliance with U.S. and local country laws. By using this product you
    agree to comply with applicable laws and regulations. If you are unable
    to comply with U.S. and local laws, return this product immediately.
    A summary of U.S. laws governing Cisco cryptographic products may be found at:
    http://www.cisco.com/wwl/export/crypto/tool/stqrg.html
    If you require further assistance please contact us by sending email to
    export@cisco.com.
    cisco WS-C2960-24TT-L (PowerPC405) processor (revision B0) with 65536K bytes of memory.
    Processor board ID FOC1010X104
    Last reset from power-on
    1 Virtual Ethernet interface
    24 FastEthernet interfaces
    2 Gigabit Ethernet interfaces
    The password-recovery mechanism is enabled.
    64K bytes of flash-simulated non-volatile configuration memory.
    Base ethernet MAC Address       : 00:90:2B:80:9B:A3
    Motherboard assembly number     : 73-10390-03
    Power supply part number        : 341-0097-02
    Motherboard serial number       : FOC10093R12
    Power supply serial number      : AZS1007032H
    Model revision number           : B0
    Motherboard revision number     : B0
    Model number                    : WS-C2960-24TT-L
    System serial number            : FOC1010X104
    Top Assembly Part Number        : 800-27221-02
    Top Assembly Revision Number    : A0
    Version ID                      : V02
    CLEI Code Number                : COM3L00BRA
    Hardware Board Revision Number  : 0x01
    Switch Ports Model              SW Version            SW Image
    ------ ----- -----              ----------            ----------
    *    1 26    WS-C2960-24TT-L    15.0(2)SE4            C2960-LANBASEK9-M
    Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 15.0(2)SE4, RELEASE SOFTWARE (fc1)
    Technical Support: http://www.cisco.com/techsupport
    Copyright (c) 1986-2013 by Cisco Systems, Inc.
    Compiled Wed 26-Jun-13 02:49 by mnguyen
    Press RETURN to get started!
    %SYS-5-CONFIG_I: Configured from console by console
Switch>en
Switch#show ver
    Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 15.0(2)SE4, RELEASE SOFTWARE (fc1)
    Technical Support: http://www.cisco.com/techsupport
    Copyright (c) 1986-2013 by Cisco Systems, Inc.
    Compiled Wed 26-Jun-13 02:49 by mnguyen
    ROM: Bootstrap program is C2960 boot loader
    BOOTLDR: C2960 Boot Loader (C2960-HBOOT-M) Version 12.2(25r)FX, RELEASE SOFTWARE (fc4)
    Switch uptime is 39 minutes
    System returned to ROM by power-on
    System image file is "flash:c2960-lanbasek9-mz.150-2.SE4.bin"
    This product contains cryptographic features and is subject to United
    States and local country laws governing import, export, transfer and
    use. Delivery of Cisco cryptographic products does not imply
    third-party authority to import, export, distribute or use encryption.
    Importers, exporters, distributors and users are responsible for
    compliance with U.S. and local country laws. By using this product you
    agree to comply with applicable laws and regulations. If you are unable
    to comply with U.S. and local laws, return this product immediately.
    A summary of U.S. laws governing Cisco cryptographic products may be found at:
    http://www.cisco.com/wwl/export/crypto/tool/stqrg.html
    If you require further assistance please contact us by sending email to
    export@cisco.com.
    cisco WS-C2960-24TT-L (PowerPC405) processor (revision B0) with 65536K bytes of memory.
    Processor board ID FOC1010X104
    Last reset from power-on
    1 Virtual Ethernet interface
    24 FastEthernet interfaces
    2 Gigabit Ethernet interfaces
    The password-recovery mechanism is enabled.
    64K bytes of flash-simulated non-volatile configuration memory.
    Base ethernet MAC Address       : 00:90:2B:80:9B:A3
    Motherboard assembly number     : 73-10390-03
    Power supply part number        : 341-0097-02
    Motherboard serial number       : FOC10093R12
    Power supply serial number      : AZS1007032H
    Model revision number           : B0
    Motherboard revision number     : B0
    Model number                    : WS-C2960-24TT-L
    System serial number            : FOC1010X104
    Top Assembly Part Number        : 800-27221-02
    Top Assembly Revision Number    : A0
    Version ID                      : V02
    CLEI Code Number                : COM3L00BRA
    Hardware Board Revision Number  : 0x01
    Switch Ports Model              SW Version            SW Image
    ------ ----- -----              ----------            ----------
    *    1 26    WS-C2960-24TT-L    15.0(2)SE4            C2960-LANBASEK9-M
    Configuration register is 0xF
Task:
Изменим конфигурацию. Мы можем сделать рез копию конфигурации на tftp-server
Decision:
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname sw1
sw1(config)#end
sw1#
    %SYS-5-CONFIG_I: Configured from console by console
sw1#wr mem
    Building configuration...
    [OK]
sw1#show fl
sw1#show flash:
    Directory of flash:/
        1  -rw-     4414921          <no date>  c2960-lanbase-mz.122-25.FX.bin
        4  -rw-     4670455          <no date>  c2960-lanbasek9-mz.150-2.SE4.bin
        5  -rw-        1090          <no date>  config.text
    64016384 bytes total (54929918 bytes free)
sw1#
sw1#cop
sw1#copy star
sw1#copy startup-config tf
sw1#copy startup-config tftp:
    Address or name of remote host []? 192.168.1.4
    Destination filename [sw1-confg]?
    Writing startup-config....!!
    [OK - 1090 bytes]
    1090 bytes copied in 3.092 secs (352 bytes/sec)

    Server-Services-tftp
    sw1-confg
sw1#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
sw1(config)#hos
sw1(config)#hostname switch
switch(config)#end
switch#
    %SYS-5-CONFIG_I: Configured from console by console
switch#wr mem
    Building configuration...
    [OK]
Task:
Теперь захотелось вернуть настройки
Decision:
switch#cop
switch#copy tft
switch#copy tftp: run
switch#copy tftp: running-config
    Address or name of remote host []? 192.168.1.4
    Source filename []? sw1-confg
    Destination filename [running-config]?
    Accessing tftp://192.168.1.4/sw1-confg...
    Loading sw1-confg from 192.168.1.4: !
    [OK - 1090 bytes]
    1090 bytes copied in 0 secs
sw1#
    %SYS-5-CONFIG_I: Configured from console by console
sw1#wr mem
    Building configuration...
    [OK]
sw1#reload
    Proceed with reload? [confirm]
    C2960 Boot Loader (C2960-HBOOT-M) Version 12.2(25r)FX, RELEASE SOFTWARE (fc4)
    Cisco WS-C2960-24TT (RC32300) processor (revision C0) with 21039K bytes of memory.
    2960-24TT starting...
    Base ethernet MAC Address: 0090.2B80.9BA3
    Xmodem file system is available.
    Initializing Flash...
    flashfs[0]: 3 files, 0 directories
    flashfs[0]: 0 orphaned files, 0 orphaned directories
    flashfs[0]: Total bytes: 64016384
    flashfs[0]: Bytes used: 9086466
    flashfs[0]: Bytes available: 54929918
    flashfs[0]: flashfs fsck took 1 seconds.
    ...done Initializing Flash.
    Boot Sector Filesystem (bs:) installed, fsid: 3
    Parameter Block Filesystem (pb:) installed, fsid: 4
    Loading "flash:/c2960-lanbasek9-mz.150-2.SE4.bin"...
    ########################################################################## [OK]
    Smart Init is enabled
    smart init is sizing iomem
                      TYPE      MEMORY_REQ
                    TOTAL:      0x00000000
    Rounded IOMEM up to: 0Mb.
    Using 6 percent iomem. [0Mb/512Mb]
    C2960 Boot Loader (C2960-HBOOT-M) Version 12.2(25r)FX, RELEASE SOFTWARE (fc4)
    Cisco WS-C2960-24TT (RC32300) processor (revision C0) with 21039K bytes of memory.
    2960-24TT starting...
    Base ethernet MAC Address: 0090.2B80.9BA3
    Xmodem file system is available.
    Initializing Flash...
    flashfs[0]: 3 files, 0 directories
    flashfs[0]: 0 orphaned files, 0 orphaned directories
    flashfs[0]: Total bytes: 64016384
    flashfs[0]: Bytes used: 9086466
    flashfs[0]: Bytes available: 54929918
    flashfs[0]: flashfs fsck took 1 seconds.
    ...done Initializing Flash.
    Boot Sector Filesystem (bs:) installed, fsid: 3
    Parameter Block Filesystem (pb:) installed, fsid: 4
    Loading "flash:/c2960-lanbasek9-mz.150-2.SE4.bin"...
    ########################################################################## [OK]
    Smart Init is enabled
    smart init is sizing iomem
                      TYPE      MEMORY_REQ
                    TOTAL:      0x00000000
    Rounded IOMEM up to: 0Mb.
    Using 6 percent iomem. [0Mb/512Mb]
                  Restricted Rights Legend
    Use, duplication, or disclosure by the Government is
    subject to restrictions as set forth in subparagraph
    (c) of the Commercial Computer Software - Restricted
    Rights clause at FAR sec. 52.227-19 and subparagraph
    (c) (1) (ii) of the Rights in Technical Data and Computer
    Software clause at DFARS sec. 252.227-7013.
               cisco Systems, Inc.
               170 West Tasman Drive
               San Jose, California 95134-1706
    Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 15.0(2)SE4, RELEASE SOFTWARE (fc1)
    Technical Support: http://www.cisco.com/techsupport
    Copyright (c) 1986-2013 by Cisco Systems, Inc.
    Compiled Wed 26-Jun-13 02:49 by mnguyen
    Initializing flashfs...
    fsck: Disable shadow buffering due to heap fragmentation.
    flashfs[2]: 2 files, 1 directories
    flashfs[2]: 0 orphaned files, 0 orphaned directories
    flashfs[2]: Total bytes: 32514048
    flashfs[2]: Bytes used: 11952128
    flashfs[2]: Bytes available: 20561920
    flashfs[2]: flashfs fsck took 2 seconds.
    flashfs[2]: Initialization complete....done Initializing flashfs.
    Checking for Bootloader upgrade..
    Boot Loader upgrade not required (Stage 2)
    POST: CPU MIC register Tests : Begin
    POST: CPU MIC register Tests : End, Status Passed
    POST: PortASIC Memory Tests : Begin
    POST: PortASIC Memory Tests : End, Status Passed
    POST: CPU MIC interface Loopback Tests : Begin
    POST: CPU MIC interface Loopback Tests : End, Status Passed
    POST: PortASIC RingLoopback Tests : Begin
    POST: PortASIC RingLoopback Tests : End, Status Passed
    POST: PortASIC CAM Subsystem Tests : Begin
    POST: PortASIC CAM Subsystem Tests : End, Status Passed
    POST: PortASIC Port Loopback Tests : Begin
    POST: PortASIC Port Loopback Tests : End, Status Passed
    Waiting for Port download...Complete
    This product contains cryptographic features and is subject to United
    States and local country laws governing import, export, transfer and
    use. Delivery of Cisco cryptographic products does not imply
    third-party authority to import, export, distribute or use encryption.
    Importers, exporters, distributors and users are responsible for
    compliance with U.S. and local country laws. By using this product you
    agree to comply with applicable laws and regulations. If you are unable
    to comply with U.S. and local laws, return this product immediately.
    A summary of U.S. laws governing Cisco cryptographic products may be found at:
    http://www.cisco.com/wwl/export/crypto/tool/stqrg.html
    If you require further assistance please contact us by sending email to
    export@cisco.com.
    cisco WS-C2960-24TT-L (PowerPC405) processor (revision B0) with 65536K bytes of memory.
    Processor board ID FOC1010X104
    Last reset from power-on
    1 Virtual Ethernet interface
    24 FastEthernet interfaces
    2 Gigabit Ethernet interfaces
    The password-recovery mechanism is enabled.
    64K bytes of flash-simulated non-volatile configuration memory.
    Base ethernet MAC Address       : 00:90:2B:80:9B:A3
    Motherboard assembly number     : 73-10390-03
    Power supply part number        : 341-0097-02
    Motherboard serial number       : FOC10093R12
    Power supply serial number      : AZS1007032H
    Model revision number           : B0
    Motherboard revision number     : B0
    Model number                    : WS-C2960-24TT-L
    System serial number            : FOC1010X104
    Top Assembly Part Number        : 800-27221-02
    Top Assembly Revision Number    : A0
    Version ID                      : V02
    CLEI Code Number                : COM3L00BRA
    Hardware Board Revision Number  : 0x01
    Switch Ports Model              SW Version            SW Image
    ------ ----- -----              ----------            ----------
    *    1 26    WS-C2960-24TT-L    15.0(2)SE4            C2960-LANBASEK9-M
    Cisco IOS Software, C2960 Software (C2960-LANBASEK9-M), Version 15.0(2)SE4, RELEASE SOFTWARE (fc1)
    Technical Support: http://www.cisco.com/techsupport
    Copyright (c) 1986-2013 by Cisco Systems, Inc.
    Compiled Wed 26-Jun-13 02:49 by mnguyen
    Press RETURN to get started!
    %SYS-5-CONFIG_I: Configured from console by console
Task:
Представим ситуацию, что кампания растет, и она решает добавить еще один филиал в соседный город. И ему нужно организовать удаленный доступ к серверам в центральном офисе. То есть мы хотим настроить связь через vpn от центрального офиса к филиалу и наоборот.
Decision:
    Router2-CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa
Router(config)#int fastEthernet 0/0
Router(config-if)#de
Router(config-if)#des
Router(config-if)#description site1
Router(config-if)#ip add
Router(config-if)#ip address 210.210.1.1 255.255.255.252
Router(config-if)#no st
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
Router(config-if)#exit
Router(config)#int fastEthernet 0/1
Router(config-if)#description site2
Router(config-if)#ip address 210.210.2.1 255.255.255.252
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up
Router(config-if)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    Router0-CLI
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int
Router(config)#interface fa
Router(config)#interface fastEthernet 0
Router(config)#interface fastEthernet 0/0
Router(config-if)#des
Router(config-if)#description outside
Router(config-if)#ip ad
Router(config-if)#ip address 210.210.1.2 255.255.255.252
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
Router(config-if)#exit
Router(config)#interface fastEthernet 0/1
Router(config-if)#dis
Router(config-if)#des
Router(config-if)#description inside
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up
Router(config-if)#exit
Router(config)#ip r
Router(config)#ip rou
Router(config)#ip route 0.0.0.0 0.0.0.0 210.210.1.1
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router(config-if)#show run
    Building configuration...
    Current configuration : 724 bytes
    !
    version 15.1
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Router
    !
    !
    !
    !
    !
    !
    !
    !
    ip cef
    no ipv6 cef
    !
    !
    !
    !
    license udi pid CISCO2811/K9 sn FTX1017P684-
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface FastEthernet0/0
     description outside
     ip address 210.210.1.2 255.255.255.252
     duplex auto
     speed auto
    !
    interface FastEthernet0/1
     description inside
     ip address 192.168.1.1 255.255.255.0
     duplex auto
     speed auto
    !
    interface Vlan1
     no ip address
     shutdown
    !
    ip classless
    ip route 0.0.0.0 0.0.0.0 210.210.1.1
    !
Task:
Обеспечим доступ в интернет с помощью Nat
Decision:
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa
Router(config)#int fastEthernet 0/0
Router(config-if)#i[ na
Router(config-if)#ip nat out
Router(config-if)#ip nat outside
Router(config-if)#exit
Router(config)#ip accs
Router(config)#int fastEthernet 0/1
Router(config-if)#ip nat inside
Router(config-if)#exit
Router(config)#ip acc
Router(config)#ip access-list stan
Router(config)#ip access-list standard FOR-NAT
Router(config-std-nacl)#per
Router(config-std-nacl)#permit 192.168.1.0 ?
      A.B.C.D  Wildcard bits
      <cr>
Router(config-std-nacl)#permit 192.168.1.0 0.0.0.255
Router(config-std-nacl)#exit
Router(config)#ip nat inside source list FOR-NAT interface fastEthernet 0/0 overload
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Task:
Тоже самое проделаем для Router 1
Decision:
     Router1-CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int
Router(config)#interface fat
Router(config)#interface faa
Router(config)#interface fas
Router(config)#interface fastEthernet 0/0
Router(config-if)#des
Router(config-if)#description ou
Router(config-if)#description outside
Router(config-if)#ip add
Router(config-if)#ip address 210.210.2.2 255.255.255.252
Router(config-if)#no sh
Router(config-if)#no shutdown exit
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#interface fastEthernet 0/0
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#interface fastEthernet 0/1
Router(config-if)#description inside
Router(config-if)#ip address 210.210.2.1 255.255.255.0
    % 210.210.2.0 overlaps with FastEthernet0/0
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#exit
Router(config)#ip route 0.0.0.0 0.0.0.0 210.210.2.1
Router(config-if)#no shutdown
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#in
Router(config)#interface fa
Router(config)#interface fastEthernet 0/0
Router(config-if)#ip nat ou
Router(config-if)#ip nat outside
Router(config-if)#exit
Router(config)#interface fastEthernet 0/1
Router(config-if)#ip nat inside
Router(config-if)#exit
Router(config)#ip acc
Router(config)#ip access-list st
Router(config)#ip access-list standard FOR-NAT
Router(config-std-nacl)#per
Router(config-std-nacl)#permit 192.168.2.0 0.0.0.255
Router(config-std-nacl)#exit
Router(config)#ip n
Router(config)#ip nat ins
Router(config)#ip nat inside so
Router(config)#ip nat inside source li
Router(config)#ip nat inside source list FOR-NAT in
Router(config)#ip nat inside source list FOR-NAT interface fa
Router(config)#ip nat inside source list FOR-NAT interface fastEthernet 0/0 over
Router(config)#ip nat inside source list FOR-NAT interface fastEthernet 0/0 overload
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    PC-PT PC2 - Desktop - command prompt
C:\>ping 210.210.2.1
    Pinging 210.210.2.1 with 32 bytes of data:
    Request timed out.
    Reply from 210.210.2.1: bytes=32 time<1ms TTL=254
    Reply from 210.210.2.1: bytes=32 time<1ms TTL=254
    Reply from 210.210.2.1: bytes=32 time=1ms TTL=254
    Ping statistics for 210.210.2.1:
        Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 1ms, Average = 0ms
Task:
Теперь настроим VPN. Сначала необходимо настроить первую фазу
Decision:
    Router0-CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#cry
Router(config)#crypto is
Router(config)#crypto isakmp po
Router(config)#crypto isakmp policy 1
Router(config-isakmp)#enc
Router(config-isakmp)#encryption 3
Router(config-isakmp)#encryption 3des
Router(config-isakmp)#ha
Router(config-isakmp)#hash md5
Router(config-isakmp)#aut
Router(config-isakmp)#authentication pre-
Router(config-isakmp)#authentication pre-share
Router(config-isakmp)#group 2
Router(config-isakmp)#exit
Router(config)#cr
Router(config)#crypto is
Router(config)#crypto isakmp ke
Router(config)#crypto isakmp key cis
Router(config)#crypto isakmp key cisc
Router(config)#crypto isakmp key cisco ad
Router(config)#crypto isakmp key cisco address 210.210.2.2
Task:
Вторая фаза
Decision:
Router(config)#ip acc
Router(config)#ip access-list ext
Router(config)#ip access-list extended FOR-VPN
Router(config-ext-nacl)#perm
Router(config-ext-nacl)#permit ip 192.168.1.0 0.0.0.255 192.168.2.0
    % Incomplete command.
Router(config-ext-nacl)#per
Router(config-ext-nacl)#permit ip 192.168.1.0 0.0.0.255 192.168.2.0 0.0.0.255
Router(config-ext-nacl)#exit
Router(config)#cr
Router(config)#crypto ips
Router(config)#crypto ipsec tra
Router(config)#crypto ipsec transform-set TS es
Router(config)#crypto ipsec transform-set TS esp
Router(config)#crypto ipsec transform-set TS esp-
Router(config)#crypto ipsec transform-set TS esp-3d
Router(config)#crypto ipsec transform-set TS esp-3des esp-md
Router(config)#crypto ipsec transform-set TS esp-3des esp-md5-hmac
Router(config)#cr
Router(config)#crypto ma
Router(config)#crypto map CM
Router(config)#crypto map CMAP 10 ips
Router(config)#crypto map CMAP 10 ipsec-isakmp
    % NOTE: This new crypto map will remain disabled until a peer
            and a valid access list have been configured.
Router(config-crypto-map)#set peer 210.210.2.2
Router(config-crypto-map)#set trans
Router(config-crypto-map)#set transform-set TSmatc
Router(config-crypto-map)#set transform-set TS
Router(config-crypto-map)#mat
Router(config-crypto-map)#match addr
Router(config-crypto-map)#match address FOR-VPN
Router(config-crypto-map)#exit
Router(config)#int fa
Router(config)#int fastEthernet 0/0
Router(config-if)#cry
Router(config-if)#crypto map CMAP
    *Jan  3 07:16:26.785: %CRYPTO-6-ISAKMP_ON_OFF: ISAKMP is ON
Router(config-if)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Task:
Сделаем тоже самое для роутера филиала
Decision:
    Router1-CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#cr
Router(config)#crypto is
Router(config)#crypto isakmp pol
Router(config)#crypto isakmp policy 1
Router(config-isakmp)#enc
Router(config-isakmp)#encryption 3de
Router(config-isakmp)#encryption 3des
Router(config-isakmp)#has
Router(config-isakmp)#hash md5
Router(config-isakmp)#aut
Router(config-isakmp)#authentication pre-sh
Router(config-isakmp)#authentication pre-share
Router(config-isakmp)#gro
Router(config-isakmp)#group 2
Router(config-isakmp)#exit
Router(config)#cr
Router(config)#crypto is
Router(config)#crypto isakmp key
Router(config)#crypto isakmp key cis
Router(config)#crypto isakmp key cisco add
Router(config)#crypto isakmp key cisco address 210.210.1.2
Router(config)#cr
Router(config)#crypto i[se
Router(config)#crypto ips
Router(config)#crypto ipsec tr
Router(config)#crypto ipsec transform-set TS es
Router(config)#crypto ipsec transform-set TS esp
Router(config)#crypto ipsec transform-set TS esp-3
Router(config)#crypto ipsec transform-set TS esp-3des esp
Router(config)#crypto ipsec transform-set TS esp-3des esp-md
Router(config)#crypto ipsec transform-set TS esp-3des esp-md5-hmac
Router(config)#ip acc
Router(config)#ip access-list ext
Router(config)#ip access-list extended FOR-VPN
Router(config-ext-nacl)#perm
Router(config-ext-nacl)#permit ip 192.168.2.0 0.0.0.255 192.168.1.0 0.0.0.255
Router(config-ext-nacl)#exit
Router(config)#cr
Router(config)#crypto ma
Router(config)#crypto map CMEP 10 ips
Router(config)#crypto map CMEP 10 ipsec-isakmp
    % NOTE: This new crypto map will remain disabled until a peer
            and a valid access list have been configured.
Router(config-crypto-map)#set peer 210.210.1.2
Router(config-crypto-map)#set trans
Router(config-crypto-map)#set transform-set TS
Router(config-crypto-map)#mat
Router(config-crypto-map)#match addre
Router(config-crypto-map)#match address FOR-VPN
Router(config-crypto-map)#exit
Router(config)#int
Router(config)#interface fa
Router(config)#interface fastEthernet 0/0
Router(config-if)#cr
Router(config-if)#crypto m
Router(config-if)#crypto map CMAP
    ERROR: Crypto Map with tag CMAP does not exist.
Router(config-if)#exit
Router(config)#cr
Router(config)#crypto ips
Router(config)#crypto ma
Router(config)#crypto map CMAP 10 ip
Router(config)#crypto map CMAP 10 ipsec-isakmp
    % NOTE: This new crypto map will remain disabled until a peer
            and a valid access list have been configured.
Router(config-crypto-map)#set peer 210.210.1.2
Router(config-crypto-map)#set transform-set TS
Router(config-crypto-map)#match address FOR-VPN
Router(config-crypto-map)#exit
Router(config)#interface fastEthernet 0/0
Router(config-if)#crypto map CMAP
    *Jan  3 07:16:26.785: %CRYPTO-6-ISAKMP_ON_OFF: ISAKMP is ON
Router(config-if)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    PC0-desktop-command prompt
C:\>ping 192.168.2.2
    Pinging 192.168.2.2 with 32 bytes of data:
    Request timed out.
    Reply from 210.210.1.1: Destination host unreachable.
    Reply from 210.210.1.1: Destination host unreachable.
    Reply from 210.210.1.1: Destination host unreachable.
    Ping statistics for 192.168.2.2:
        Packets: Sent = 4, Received = 0, Lost = 4 (100% loss),

    Router0-CLI
Router#show run
    Building configuration...
    Current configuration : 1272 bytes
    !
    version 15.1
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Router
    !
    !
    !
    !
    !
    !
    !
    !
    ip cef
    no ipv6 cef
    !
    !
    !
    !
    license udi pid CISCO2811/K9 sn FTX1017P684-
    !
    !
    !
    crypto isakmp policy 1
     encr 3des
     hash md5
     authentication pre-share
     group 2
    !
    crypto isakmp key cisco address 210.210.2.2
    !
    !
    !
    crypto ipsec transform-set TS esp-3des esp-md5-hmac
    !
    crypto map CMAP 10 ipsec-isakmp
     set peer 210.210.2.2
     set transform-set TS
     match address FOR-VPN
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface FastEthernet0/0
     description outside
     ip address 210.210.1.2 255.255.255.252
     ip nat outside
     duplex auto
     speed auto
     crypto map CMAP
    !
    interface FastEthernet0/1
     description inside
     ip address 192.168.1.1 255.255.255.0
     ip nat inside
     duplex auto
     speed auto
    !
    interface Vlan1
     no ip address
     shutdown
    !
    ip nat inside source list FOR-NAT interface FastEthernet0/0 overload
    ip classless
    ip route 0.0.0.0 0.0.0.0 210.210.1.1
    !
    ip flow-export version 9
    !
    !
    ip access-list standard FOR-NAT
     permit 192.168.1.0 0.0.0.255
    ip access-list extended FOR-VPN
     permit ip 192.168.1.0 0.0.0.255 192.168.2.0 0.0.0.255
Task:
Нам нужно указать, что трафик локальной сети филиала  не нужно натить
Decision:
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#no ip access-list standard FOR-NAT
Router(config)#ip acc
Router(config)#ip access-list exte
Router(config)#ip access-list extended FOR-NAT
Router(config-ext-nacl)#deny ip 192.168.1.0 0.0.0.255 192.168.2.0 0.0.0.255
Router(config-ext-nacl)#permit ip 192.168.1.0 0.0.0.255 any
Router(config-ext-nacl)#exit
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#show run
    Building configuration...
    Current configuration : 1332 bytes
    !
    version 15.1
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Router
    !
    !
    !
    !
    !
    !
    !
    !
    ip cef
    no ipv6 cef
    !
    !
    !
    !
    license udi pid CISCO2811/K9 sn FTX1017P684-
    !
    !
    !
    crypto isakmp policy 1
     encr 3des
     hash md5
     authentication pre-share
     group 2
    !
    crypto isakmp key cisco address 210.210.2.2
    !
    !
    !
    crypto ipsec transform-set TS esp-3des esp-md5-hmac
    !
    crypto map CMAP 10 ipsec-isakmp
     set peer 210.210.2.2
     set transform-set TS
     match address FOR-VPN
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface FastEthernet0/0
     description outside
     ip address 210.210.1.2 255.255.255.252
     ip nat outside
     duplex auto
     speed auto
     crypto map CMAP
    !
    interface FastEthernet0/1
     description inside
     ip address 192.168.1.1 255.255.255.0
     ip nat inside
     duplex auto
     speed auto
    !
    interface Vlan1
     no ip address
     shutdown
    !
    ip nat inside source list FOR-NAT interface FastEthernet0/0 overload
    ip classless
    ip route 0.0.0.0 0.0.0.0 210.210.1.1
    !
    ip flow-export version 9
    !
    !
    ip access-list extended FOR-VPN
     permit ip 192.168.1.0 0.0.0.255 192.168.2.0 0.0.0.255
    ip access-list extended FOR-NAT
     deny ip 192.168.1.0 0.0.0.255 192.168.2.0 0.0.0.255
     permit ip 192.168.1.0 0.0.0.255 any

    Router1-CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#no ip ac
Router(config)#no ip access-list stand
Router(config)#no ip access-list standard FOR-NAT
Router(config)#ip acc
Router(config)#ip access-list ext
Router(config)#ip access-list extended F
Router(config)#ip access-list extended FOR-NAT
Router(config-ext-nacl)#deny ip 192.168.2.0 0.0.0.255 192.168.1.0 0.0.0.255
Router(config-ext-nacl)#perm
Router(config-ext-nacl)#permit ip 192.168.2.0 0.0.0.255 any
Router(config-ext-nacl)#exit
Router(config)#exit
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#show run
    Building configuration...
    Current configuration : 1437 bytes
    !
    version 15.1
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Router
    !
    !
    !
    !
    !
    !
    !
    !
    ip cef
    no ipv6 cef
    !
    !
    !
    !
    license udi pid CISCO2811/K9 sn FTX1017S440-
    !
    !
    !
    crypto isakmp policy 1
     encr 3des
     hash md5
     authentication pre-share
     group 2
    !
    crypto isakmp key cisco address 210.210.1.2
    !
    !
    !
    crypto ipsec transform-set TS esp-3des esp-md5-hmac
    !
    crypto map CMEP 10 ipsec-isakmp
     set peer 210.210.1.2
     set transform-set TS
     match address FOR-VPN
    !
    !
    crypto map CMAP 10 ipsec-isakmp
     set peer 210.210.1.2
     set transform-set TS
     match address FOR-VPN
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface FastEthernet0/0
     description outside
     ip address 210.210.2.2 255.255.255.252
     ip nat outside
     duplex auto
     speed auto
     crypto map CMAP
    !
    interface FastEthernet0/1
     description inside
     ip address 192.168.2.1 255.255.255.0
     ip nat inside
     duplex auto
     speed auto
    !
    interface Vlan1
     no ip address
     shutdown
    !
    ip nat inside source list FOR-NAT interface FastEthernet0/0 overload
    ip classless
    ip route 0.0.0.0 0.0.0.0 210.210.2.1
    !
    ip flow-export version 9
    !
    !
    ip access-list extended FOR-VPN
     permit ip 192.168.2.0 0.0.0.255 192.168.1.0 0.0.0.255
    ip access-list extended FOR-NAT
     deny ip 192.168.2.0 0.0.0.255 192.168.1.0 0.0.0.255
     permit ip 192.168.2.0 0.0.0.255 any
Router#wr mem
    Building configuration...
    [OK]

    PC0-desktop-command prompt
C:\>ping 192.168.2.2
    Pinging 192.168.2.2 with 32 bytes of data:
    Request timed out.
    Request timed out.
    Reply from 192.168.2.2: bytes=32 time<1ms TTL=126
    Reply from 192.168.2.2: bytes=32 time=16ms TTL=126
    Ping statistics for 192.168.2.2:
        Packets: Sent = 4, Received = 2, Lost = 2 (50% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 16ms, Average = 8ms

    Router0-CLI
Router>en
Router#show
Router#show cr
Router#show crypto is
Router#show crypto isakmp sa
    IPv4 Crypto ISAKMP SA
    dst             src             state          conn-id slot status
    210.210.2.2     210.210.1.2     QM_IDLE           1028    0 ACTIVE
IPv6 Crypto ISAKMP SA
Router#show crypto ip
Router#show crypto ipsec sa
    interface: FastEthernet0/0
        Crypto map tag: CMAP, local addr 210.210.1.2
       protected vrf: (none)
       local  ident (addr/mask/prot/port): (192.168.1.0/255.255.255.0/0/0)
       remote  ident (addr/mask/prot/port): (192.168.2.0/255.255.255.0/0/0)
       current_peer 210.210.2.2 port 500
        PERMIT, flags={origin_is_acl,}
       #pkts encaps: 6, #pkts encrypt: 6, #pkts digest: 0
       #pkts decaps: 6, #pkts decrypt: 6, #pkts verify: 0
       #pkts compressed: 0, #pkts decompressed: 0
       #pkts not compressed: 0, #pkts compr. failed: 0
       #pkts not decompressed: 0, #pkts decompress failed: 0
       #send errors 1, #recv errors 0
         local crypto endpt.: 210.210.1.2, remote crypto endpt.:210.210.2.2
         path mtu 1500, ip mtu 1500, ip mtu idb FastEthernet0/0
         current outbound spi: 0x541FFE4D(1411382861)
         inbound esp sas:
          spi: 0x03C92BD9(63515609)
            transform: esp-3des esp-md5-hmac ,
Decision:
    R1-CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#route
Router(config)#router ei
Router(config)#router eigrp ?
      <1-65535>  Autonomous system number
Router(config)#router eigrp 1
Router(config-router)#network 192.168.1.0 0.0.0.255
Router(config-router)#network 10.10.10.0 0.0.0.3
Router(config-router)#network 10.10.11.0 0.0.0.3
Router(config-router)#no au
Router(config-router)#no auto-summary
Router(config-router)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    R2-CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#router ei
Router(config)#router eigrp 1
Router(config-router)#netw
Router(config-router)#network 192.168.2.0 0.0.0.255
Router(config-router)#network 10.10.10.0 0.0.0.3
Router(config-router)#
    %DUAL-5-NBRCHANGE: IP-EIGRP 1: Neighbor 10.10.10.1 (GigabitEthernet0/0) is up: new adjacency
Router(config-router)#network 10.10.12.0 0.0.0.3
Router(config-router)#no a
Router(config-router)#no auto-summary
Router(config-router)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    R3-CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ro
Router(config)#router e
Router(config)#router eigrp 1
Router(config-router)#net
Router(config-router)#network 192.168.3.0 0.0.0.255
Router(config-router)#netw
Router(config-router)#network 10.10.11.0 0.0.0.3
Router(config-router)#
    %DUAL-5-NBRCHANGE: IP-EIGRP 1: Neighbor 10.10.11.1 (GigabitEthernet0/1) is up: new adjacency
Router(config-router)#network 10.10.12.0 0.0.0.3
Router(config-router)#
    %DUAL-5-NBRCHANGE: IP-EIGRP 1: Neighbor 10.10.12.1 (GigabitEthernet0/0) is up: new adjacency
Router(config-router)#no a
Router(config-router)#no auto-summary
Router(config-router)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#show ip eigrp neighbors
    IP-EIGRP neighbors for process 1
    H   Address         Interface      Hold Uptime    SRTT   RTO   Q   Seq
                                       (sec)          (ms)        Cnt  Num
    0   10.10.11.1      Gig0/1         14   00:02:20  40     1000  0   8
    1   10.10.12.1      Gig0/0         12   00:02:04  40     1000  0   12
Router#show ip route
    Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
           D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
           N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
           E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
           i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
           * - candidate default, U - per-user static route, o - ODR
           P - periodic downloaded static route
    Gateway of last resort is not set
         10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
    D       10.10.10.0/30 [90/3072] via 10.10.11.1, 00:03:11, GigabitEthernet0/1
                          [90/3072] via 10.10.12.1, 00:02:56, GigabitEthernet0/0
    C       10.10.11.0/30 is directly connected, GigabitEthernet0/1
    L       10.10.11.2/32 is directly connected, GigabitEthernet0/1
    C       10.10.12.0/30 is directly connected, GigabitEthernet0/0
    L       10.10.12.2/32 is directly connected, GigabitEthernet0/0
    D    192.168.1.0/24 [90/5376] via 10.10.11.1, 00:03:11, GigabitEthernet0/1
    D    192.168.2.0/24 [90/5376] via 10.10.12.1, 00:02:56, GigabitEthernet0/0
         192.168.3.0/24 is variably subnetted, 2 subnets, 2 masks
    C       192.168.3.0/24 is directly connected, GigabitEthernet0/2
    L       192.168.3.1/32 is directly connected, GigabitEthernet0/2
         192.168.100.0/32 is subnetted, 1 subnets
    C       192.168.100.3/32 is directly connected, Loopback0

    PC3-Desktop-Command prompt
C:\>ping 192.168.2.2
    Pinging 192.168.2.2 with 32 bytes of data:
    Request timed out.
    Reply from 192.168.2.2: bytes=32 time<1ms TTL=126
    Reply from 192.168.2.2: bytes=32 time=11ms TTL=126
    Reply from 192.168.2.2: bytes=32 time<1ms TTL=126
    Ping statistics for 192.168.2.2:
        Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 11ms, Average = 3ms
C:\>ping 192.168.1.2
    Pinging 192.168.1.2 with 32 bytes of data:
    Request timed out.
    Reply from 192.168.1.2: bytes=32 time<1ms TTL=126
    Reply from 192.168.1.2: bytes=32 time<1ms TTL=126
    Reply from 192.168.1.2: bytes=32 time=17ms TTL=126
    Ping statistics for 192.168.1.2:
        Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 17ms, Average = 5ms
Task:
Проверим на отказоустойчивость
Decision:
    C:\>ping 192.168.2.2 -n 1000
    Pinging 192.168.2.2 with 32 bytes of data:
    Reply from 192.168.2.2: bytes=32 time<1ms TTL=126
    Reply from 192.168.2.2: bytes=32 time=11ms TTL=126
    Reply from 192.168.2.2: bytes=32 time=10ms TTL=126
    Reply from 192.168.2.2: bytes=32 time<1ms TTL=125
    Reply from 192.168.2.2: bytes=32 time<1ms TTL=125
    Reply from 192.168.2.2: bytes=32 time<1ms TTL=125
    Reply from 192.168.2.2: bytes=32 time=2ms TTL=125
    Reply from 192.168.2.2: bytes=32 time=15ms TTL=125
    Reply from 192.168.2.2: bytes=32 time<1ms TTL=125
    Reply from 192.168.2.2: bytes=32 time=11ms TTL=125
    Reply from 192.168.2.2: bytes=32 time<1ms TTL=125
    Reply from 192.168.2.2: bytes=32 time=3ms TTL=125
    Reply from 192.168.2.2: bytes=32 time<1ms TTL=125
    Reply from 192.168.2.2: bytes=32 time<1ms TTL=125
    Ping statistics for 192.168.2.2:
        Packets: Sent = 14, Received = 14, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 15ms, Average = 3ms

    R2-CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int
Router(config)#interface gi
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#shut
Router(config-if)#shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to administratively down
    %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to down
    00:31:18: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.100.3 on GigabitEthernet0/1 from FULL to DOWN, Neighbor Down: Interface down or detached
    %DUAL-5-NBRCHANGE: IP-EIGRP 1: Neighbor 10.10.12.2 (GigabitEthernet0/1) is down: interface down

    R3-CLI
Router#show ip route
    Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
           D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
           N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
           E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
           i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
           * - candidate default, U - per-user static route, o - ODR
           P - periodic downloaded static route
    Gateway of last resort is not set
         10.0.0.0/8 is variably subnetted, 3 subnets, 2 masks
    D       10.10.10.0/30 [90/3072] via 10.10.11.1, 00:16:55, GigabitEthernet0/1
    C       10.10.11.0/30 is directly connected, GigabitEthernet0/1
    L       10.10.11.2/32 is directly connected, GigabitEthernet0/1
    D    192.168.1.0/24 [90/5376] via 10.10.11.1, 00:16:55, GigabitEthernet0/1
    D    192.168.2.0/24 [90/5632] via 10.10.11.1, 00:04:08, GigabitEthernet0/1
         192.168.3.0/24 is variably subnetted, 2 subnets, 2 masks
    C       192.168.3.0/24 is directly connected, GigabitEthernet0/2
    L       192.168.3.1/32 is directly connected, GigabitEthernet0/2
         192.168.100.0/32 is subnetted, 1 subnets
    C       192.168.100.3/32 is directly connected, Loopback0

    R2-CLI
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up
    %DUAL-5-NBRCHANGE: IP-EIGRP 1: Neighbor 10.10.12.2 (GigabitEthernet0/1) is up: new adjacency
Router(config-if)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#
    00:39:10: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.100.3 on GigabitEthernet0/1 from LOADING to FULL, Loading Done
Task:
Настроим дефолтную маршрутизацию, чтобы не прописывать ip адреса. Пусть роутер R3 имеет деволтный маршрут через компьютер PC3. Распространим данные по дефолтному маршруту
Decision:
    R3-CLI
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip ro
Router(config)#ip rou
Router(config)#ip route 0.0.0.0 0.0.0.0 192.168.3.2
Router(config)#rou
Router(config)#router ei
Router(config)#router eigrp 1
Router(config-router)#red
Router(config-router)#redistribute st
Router(config-router)#redistribute static
Router(config-router)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    R2-CLI
Router#show ip route
    Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
           D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
           N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
           E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
           i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
           * - candidate default, U - per-user static route, o - ODR
           P - periodic downloaded static route
    Gateway of last resort is 10.10.12.2 to network 0.0.0.0
         10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
    C       10.10.10.0/30 is directly connected, GigabitEthernet0/0
    L       10.10.10.2/32 is directly connected, GigabitEthernet0/0
    D       10.10.11.0/30 [90/3072] via 10.10.10.1, 00:33:28, GigabitEthernet0/0
                          [90/3072] via 10.10.12.2, 00:08:55, GigabitEthernet0/1
    C       10.10.12.0/30 is directly connected, GigabitEthernet0/1
    L       10.10.12.1/32 is directly connected, GigabitEthernet0/1
    D    192.168.1.0/24 [90/5376] via 10.10.10.1, 00:33:28, GigabitEthernet0/0
         192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
    C       192.168.2.0/24 is directly connected, GigabitEthernet0/2
    L       192.168.2.1/32 is directly connected, GigabitEthernet0/2
    D    192.168.3.0/24 [90/5376] via 10.10.12.2, 00:08:55, GigabitEthernet0/1
         192.168.100.0/32 is subnetted, 1 subnets
    C       192.168.100.2/32 is directly connected, Loopback0
    D*EX 0.0.0.0/0 [170/28416] via 10.10.12.2, 00:01:28, GigabitEthernet0/1
Task:
Consider three routers and three computers that are hiding in the network behind the router
It is necessary to make sure that all ip addresses are available on the computer network, while it is not necessary to prescribe static routes on routers
Decision:
    R1 - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#in
Router(config)#interface gi
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip address 10.10.10.1 255.255.255.252
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up
Router(config-if)#exit
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip address 10.10.11.1 255.255.255.252
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up
Router(config-if)#exit
Router(config)#interface gigabitEthernet 0/2
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/2, changed state to up
Router(config-if)#exit
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    R2 - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int
Router(config)#interface G
Router(config)#interface GigabitEthernet 0/0
Router(config-if)#ipad
Router(config-if)#ip add
Router(config-if)#ip address 10.10.10.2 255.255.255.252
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up
Router(config-if)#exit
Router(config)#interface GigabitEthernet 0/1
Router(config-if)#ip address 10.10.12.1 255.255.255.252
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up
Router(config-if)#exit
Router(config)#interface GigabitEthernet 0/2
Router(config-if)#ip address 192.168.2.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/2, changed state to up
Router(config-if)#exit
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building

    R3 - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int
Router(config)#interface G
Router(config)#interface GigabitEthernet 0/0
Router(config-if)#ip ad
Router(config-if)#ip address 10.10.12.2 255.255.255.252
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up
Router(config-if)#exit
Router(config)#interface GigabitEthernet 0/1
Router(config-if)#ip address 10.10.11.2 255.255.255.252
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up
Router(config-if)#interface GigabitEthernet 0/2
Router(config-if)#exit
Router(config)#interface GigabitEthernet 0/2
Router(config-if)#ip address 192.168.3.1 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/2, changed state to up
Router(config-if)#exit
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    PC1,2,3 - ip address: 192.168.1.2, 2.2, 3.2 - Gateway: 192.168.1.1, 2.1, 3.1 - R1 - CLI
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int loo
Router(config)#int loopback 0
Router(config-if)#
    %LINK-5-CHANGED: Interface Loopback0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up
Router(config-if)#ip add
Router(config-if)#ip address 192.168.100.1 255.255.255.255
Router(config-if)#no shu
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#rou
Router(config)#router ?
      bgp    Border Gateway Protocol (BGP)
      eigrp  Enhanced Interior Gateway Routing Protocol (EIGRP)
      ospf   Open Shortest Path First (OSPF)
      rip    Routing Information Protocol (RIP)
Router(config)#router os
Router(config)#router ospf ?
      <1-65535>  Process ID
Router(config)#router ospf 1
Task:
Укажем все сети (10.10.10.0, 11.0, 192.168.1.0), которые подключены к нашему маршрутизатору
Decision:
Router(config-router)#network 192.168.1.0 0.0.0.255 ar
Router(config-router)#network 192.168.1.0 0.0.0.255 area ?
      <0-4294967295>  OSPF area ID as a decimal value
      A.B.C.D         OSPF area ID in IP address format
Router(config-router)#network 192.168.1.0 0.0.0.255 area 0
Router(config-router)#network 10.10.10.0 0.0.0.3 area 0
Router(config-router)#network 10.10.11.0 0.0.0.3 area 0
Router(config-router)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    R2 - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#in
Router(config)#interface loo
Router(config)#interface loopback 0
Router(config-if)#
    %LINK-5-CHANGED: Interface Loopback0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up
Router(config-if)#ip
Router(config-if)#ipad
Router(config-if)#ip ad
Router(config-if)#ip address 192.168.100.2 255.255.255.255
Router(config-if)#no shu
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#rou
Router(config)#router os
Router(config)#router ospf 1
Router(config-router)#ne
Router(config-router)#net
Router(config-router)#network 192.168.2.0 0.0.0.255 area 0
Router(config-router)#network 10.10.10.0 0.0.0.3 area 0
Router(config-router)#network 10.10.12.0 0.0.0.3 area 0
Router(config-router)#
    00:39:01: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.100.1 on GigabitEthernet0/0 from LOADING to FULL, Loading Done
Router(config-router)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console

    R3 - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int
Router(config)#interface lo
Router(config)#interface loopback 0
Router(config-if)#
    %LINK-5-CHANGED: Interface Loopback0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up
Router(config-if)#ip address 192.168.100.3 255.255.255.255
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#rou
Router(config)#router os
Router(config)#router ospf 1
Router(config-router)#network 192.168.3.0 0.0.0.255 area 0
Router(config-router)#network 10.10.11.0 0.0.0.3 area 0
Router(config-router)#network 10.10.12.0 0.0.0.3 area 0
Router(config-router)#end
00:46:25: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.100.2 on GigabitEthernet0/0 from LOADING to FULL, Loading Done
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router>en
Router#show ip os
Router#show ip ospf ne
Router#show ip ospf neighbor
    Neighbor ID     Pri   State           Dead Time   Address         Interface
    192.168.100.2     1   FULL/BDR        00:00:38    10.10.12.1      GigabitEthernet0/0
    192.168.100.1     1   FULL/BDR        00:00:38    10.10.11.1      GigabitEthernet0/1
Router#show ip rou
Router#show ip route
    Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
           D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
           N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
           E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
           i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
           * - candidate default, U - per-user static route, o - ODR
           P - periodic downloaded static route
    Gateway of last resort is not set
         10.0.0.0/8 is variably subnetted, 5 subnets, 2 masks
    O       10.10.10.0/30 [110/2] via 10.10.12.1, 00:11:31, GigabitEthernet0/0
                          [110/2] via 10.10.11.1, 00:11:31, GigabitEthernet0/1
    C       10.10.11.0/30 is directly connected, GigabitEthernet0/1
    L       10.10.11.2/32 is directly connected, GigabitEthernet0/1
    C       10.10.12.0/30 is directly connected, GigabitEthernet0/0
    L       10.10.12.2/32 is directly connected, GigabitEthernet0/0
    O    192.168.1.0/24 [110/2] via 10.10.11.1, 00:11:31, GigabitEthernet0/1
    O    192.168.2.0/24 [110/2] via 10.10.12.1, 00:11:31, GigabitEthernet0/0
         192.168.3.0/24 is variably subnetted, 2 subnets, 2 masks
    C       192.168.3.0/24 is directly connected, GigabitEthernet0/2
    L       192.168.3.1/32 is directly connected, GigabitEthernet0/2
         192.168.100.0/32 is subnetted, 1 subnets
    C       192.168.100.3/32 is directly connected, Loopback0
Router#ping 192.168.1.2
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 192.168.1.2, timeout is 2 seconds:
    .!!!!
    Success rate is 80 percent (4/5), round-trip min/avg/max = 0/6/24 ms
Router#ping 192.168.2.2
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 192.168.2.2, timeout is 2 seconds:
    .!!!!
    Success rate is 80 percent (4/5), round-trip min/avg/max = 0/0/0 ms
Task:
Попробуем потушить link на роутере R1
Decision:
    R3-CLI
Router#show ip route
    ...
    O    192.168.1.0/24 [110/2] via 10.10.11.1, 00:11:31, GigabitEthernet0/1
    O    192.168.2.0/24 [110/2] via 10.10.12.1, 00:11:31, GigabitEthernet0/0
    ...

    PC3-Desktop-Command Prompt
C:\>ping
    Cisco Packet Tracer PC Ping
    Usage: ping [-n count | -v TOS | -t ] target
C:\>ping 192.168.1.2 -n 1000
    Pinging 192.168.1.2 with 32 bytes of data:
    Reply from 192.168.1.2: bytes=32 time<1ms TTL=126
    Reply from 192.168.1.2: bytes=32 time<1ms TTL=126
    Reply from 192.168.1.2: bytes=32 time<1ms TTL=126

    R1-CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#inter
Router(config)#interface g
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#sho
Router(config-if)#shutd
Router(config-if)#shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to administratively down
    %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to down
    00:25:29: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.100.3 on GigabitEthernet0/1 from FULL to DOWN, Neighbor Down: Interface down or detached

    R3-CLI
Router#
    %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to down
    00:25:29: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.100.1 on GigabitEthernet0/1 from FULL to DOWN, Neighbor Down: Interface down or detached
Router#show ip route
    Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
           D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
           N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
           E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
           i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
           * - candidate default, U - per-user static route, o - ODR
           P - periodic downloaded static route
    Gateway of last resort is not set
         10.0.0.0/8 is variably subnetted, 3 subnets, 2 masks
    O       10.10.10.0/30 [110/2] via 10.10.12.1, 00:00:06, GigabitEthernet0/0
    C       10.10.12.0/30 is directly connected, GigabitEthernet0/0
    L       10.10.12.2/32 is directly connected, GigabitEthernet0/0
    O    192.168.1.0/24 [110/3] via 10.10.12.1, 00:00:06, GigabitEthernet0/0
    O    192.168.2.0/24 [110/2] via 10.10.12.1, 00:24:45, GigabitEthernet0/0
         192.168.3.0/24 is variably subnetted, 2 subnets, 2 masks
    C       192.168.3.0/24 is directly connected, GigabitEthernet0/2
    L       192.168.3.1/32 is directly connected, GigabitEthernet0/2
         192.168.100.0/32 is subnetted, 1 subnets
    C       192.168.100.3/32 is directly connected, Loopback0

    PC3-Desktop-Command Prompt

    Reply from 192.168.1.2: bytes=32 time<1ms TTL=126
    Request timed out.
    Reply from 192.168.1.2: bytes=32 time=10ms TTL=125
    Reply from 192.168.1.2: bytes=32 time=10ms TTL=125
    Reply from 192.168.1.2: bytes=32 time=13ms TTL=125
    Reply from 192.168.1.2: bytes=32 time<1ms TTL=125
    Reply from 192.168.1.2: bytes=32 time<1ms TTL=125
Task:
Имеется 2 здания. В первом установлен Router1, во втором - Router2, и есть какой-то узел связи, где стоит центральный маршрутизатор связи, который обеспечивает нам доступ в интернет (ROuter 0). При этом каждый маршрутизатор имеет 2 сегмента - первый VLAN 10, второй VLAN 20, во тором роутере VLAN 30 и 40.
Decision:
    Switch1-CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int f
Switch(config)#int fastEthernet 0/1
Switch(config-if)#swi
Switch(config-if)#switchport mode tr
Switch(config-if)#switchport mode trunk
Switch(config-if)#switchport tru
Switch(config-if)#switchport trunk all
Switch(config-if)#switchport trunk allowed vlan 10,20
Switch(config-if)#exit
Switch(config)#in
Switch(config)#interface fa
Switch(config)#interface fastEthernet 0/2
Switch(config-if)#swi
Switch(config-if)#switchport mo
Switch(config-if)#switchport mode acc
Switch(config-if)#switchport mode access
Switch(config-if)#switchport acc
Switch(config-if)#switchport access vlan 10
    % Access VLAN does not exist. Creating vlan 10
Switch(config-if)#exit
Switch(config)#vlan 10
Switch(config-vlan)#name vlan10
Switch(config-vlan)#exit
Switch(config)#vlan 20
Switch(config-vlan)#name vlan20
Switch(config-vlan)#exit
Switch(config)#interface fastEthernet 0/2
Switch(config-if)#switchport access vlan 10
Switch(config-if)#exit
Switch(config)#interface fastEthernet 0/3
Switch(config-if)#switchport access vlan 20
Switch(config-if)#exit
Switch(config)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]
Switch#show run
    Building configuration...
    Current configuration : 1218 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface FastEthernet0/1
     switchport trunk allowed vlan 10,20
     switchport mode trunk
    !
    interface FastEthernet0/2
     switchport access vlan 10
     switchport mode access
    !
    interface FastEthernet0/3
     switchport access vlan 20
    !
    interface FastEthernet0/4
    !

    Router1-CLI
Router>en
Router#int
Router#inte
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int
Router(config)#interface fa
Router(config)#interface fastEthernet 0/0
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
Router(config-if)#exit
Router(config)#interface fastEthernet 0/1.10
Router(config-subif)#enc
Router(config-subif)#encapsulation do
Router(config-subif)#encapsulation dot1Q 10
Router(config-subif)#ip add
Router(config-subif)#ip address 192.16
Router(config-subif)#ip address 192.168.10.1 255.255.255.0
Router(config-subif)#no sh
Router(config-subif)#no shutdown
Router(config-subif)#exit
Router(config)#interface fastEthernet 0/1.20
Router(config-subif)#encapsulation dot1Q 20
Router(config-subif)#ip address 192.168.20.1 255.255.255.0
Router(config-subif)#no shutdown
Router(config-subif)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int
Router(config)#interface fa
Router(config)#interface fastEthernet 0/0
Router(config-if)#no shu
Router(config-if)#no shutdown
Router(config-if)#ip ad
Router(config-if)#ip address 192.168.1.2 255.255.255.0
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#interface fastEthernet 0/1
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up
    %LINK-5-CHANGED: Interface FastEthernet0/1.10, changed state to up
    %LINK-5-CHANGED: Interface FastEthernet0/1.20, changed state to up
Router(config-if)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#show run
    Building configuration...
    Current configuration : 767 bytes
    !
    version 12.4
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Router
    !
    !
    !
    !
    !
    !
    !
    !
    ip cef
    no ipv6 cef
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface FastEthernet0/0
     ip address 192.168.1.2 255.255.255.252
     duplex auto
     speed auto
    !
    interface FastEthernet0/1
     no ip address
     duplex auto
     speed auto
    !
    interface FastEthernet0/1.10
     encapsulation dot1Q 10
     ip address 192.168.10.1 255.255.255.0
    !
    interface FastEthernet0/1.20
     encapsulation dot1Q 20
     ip address 192.168.20.1 255.255.255.0
    !

    Switch2-CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int
Switch(config)#interface fa
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#sw
Switch(config-if)#switchport mode tr
Switch(config-if)#switchport mode trunk
Switch(config-if)#switchport trunk all
Switch(config-if)#switchport trunk allowed vlan 30,40
Switch(config-if)#exit
Switch(config)#vlan 30
Switch(config-vlan)#name vlan30
Switch(config-vlan)#exit
Switch(config)#vlan 40
Switch(config-vlan)#name vlan40
Switch(config-vlan)#exit
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#exit
Switch(config)#interface fastEthernet 0/2
Switch(config-if)#swit
Switch(config-if)#switchport ac
Switch(config-if)#switchport access vla
Switch(config-if)#switchport access vlan 30
Switch(config-if)#sw
Switch(config-if)#switchport mode ac
Switch(config-if)#switchport mode access
Switch(config-if)#exit
Switch(config)#interface fastEthernet 0/3
Switch(config-if)#switchport access vlan 40
Switch(config-if)#switchport mode access
Switch(config-if)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]
Switch#show run
    Building configuration...
    Current configuration : 1242 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface FastEthernet0/1
     switchport trunk allowed vlan 30,40
     switchport mode trunk
    !
    interface FastEthernet0/2
     switchport access vlan 30
     switchport mode access
    !
    interface FastEthernet0/3
     switchport access vlan 40
     switchport mode access
    !
    interface FastEthernet0/4
    !

    Router2-CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#in
Router(config)#interface fa
Router(config)#interface fastEthernet 0/0
Router(config-if)#ip add
Router(config-if)#ip address 192.168.2.2 255
Router(config-if)#ip address 192.168.2.2 255.255.255.252
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
Router(config-if)#exit
Router(config)#interface fastEthernet 0/1.30
Router(config-subif)#enc
Router(config-subif)#encapsulation dot
Router(config-subif)#encapsulation dot1Q 30
Router(config-subif)#ip add
Router(config-subif)#ip address 192.168.30.1 255.255.255.0
Router(config-subif)#no sh
Router(config-subif)#no shutdown
Router(config-subif)#exit
Router(config)#interface fastEthernet 0/1.40
Router(config-subif)#encapsulation dot1Q 40
Router(config-subif)#ip address 192.168.40.1 255.255.255.0
Router(config-subif)#exit
Router(config)#interface fastEthernet 0/1
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up
    %LINK-5-CHANGED: Interface FastEthernet0/1.30, changed state to up
    %LINK-5-CHANGED: Interface FastEthernet0/1.40, changed state to up
Router(config-if)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#show run
    Building configuration...
    Current configuration : 759 bytes
    !
    version 12.4
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Router
    !
    !
    !
    !
    !
    !
    !
    !
    ip cef
    no ipv6 cef
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface FastEthernet0/0
     ip address 192.168.2.2 255.255.255.252
     duplex auto
     speed auto
    !
    interface FastEthernet0/1
     no ip address
     duplex auto
     speed auto
    !
    interface FastEthernet0/1.30
     encapsulation dot1Q 30
     ip address 192.168.30.1 255.255.255.0
    !
    interface FastEthernet0/1.40
     encapsulation dot1Q 40
     ip address 192.168.40.1 255.255.255.0
    !

    Router0 - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int
Router(config)#interface G
Router(config)#interface GigabitEthernet 0/0
Router(config-if)#ip add
Router(config-if)#ip address 210.214.1.2 255.255.255.252
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up
Router(config-if)#exit
Router(config)#interface GigabitEthernet 0/1
Router(config-if)#ip address 192.168.1.1 255.255.255.252
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up
Router(config-if)#exit
Router(config)#interface GigabitEthernet 0/2
Router(config-if)#ip address 192.168.2.1 255.255.255.252
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/2, changed state to up
Router(config-if)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#show run
    Building configuration...
    Current configuration : 749 bytes
    !
    version 15.1
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Router
    !
    !
    !
    !
    !
    !
    !
    !
    ip cef
    no ipv6 cef
    !
    !
    !
    !
    license udi pid CISCO2911/K9 sn FTX1524GHMH-
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface GigabitEthernet0/0
     ip address 210.214.1.2 255.255.255.252
     duplex auto
     speed auto
    !
    interface GigabitEthernet0/1
     ip address 192.168.1.1 255.255.255.252
     duplex auto
     speed auto
    !
    interface GigabitEthernet0/2
     ip address 192.168.2.1 255.255.255.252
     duplex auto
     speed auto
    !

    Internet - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int
Router(config)#interface Gi
Router(config)#interface GigabitEthernet 0/0
Router(config-if)#ip address 210.214.1.1 255.255.255.252
Router(config-if)#exit
Router(config)#interface GigabitEthernet 0/1
Router(config-if)#ip address 210.214.2.1 255.255.255.0
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up
Router(config-if)#exit
Router(config)#interface GigabitEthernet 0/0
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up
Router(config-if)#exit
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#show run
    Building configuration...
    Current configuration : 732 bytes
    !
    version 15.1
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Router
    !
    !
    !
    !
    !
    !
    !
    !
    ip cef
    no ipv6 cef
    !
    !
    !
    !
    license udi pid CISCO2911/K9 sn FTX1524PEHQ-
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface GigabitEthernet0/0
     ip address 210.214.1.1 255.255.255.252
     duplex auto
     speed auto
    !
    interface GigabitEthernet0/1
     ip address 210.214.2.1 255.255.255.0
     duplex auto
     speed auto
    !
    interface GigabitEthernet0/2
     no ip address
     duplex auto
     speed auto
     shutdown
    !

    Router1 - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int loo
Router(config)#int loopback 0
Router(config-if)#
    %LINK-5-CHANGED: Interface Loopback0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up
Router(config-if)#ip add
Router(config-if)#ip address 192.168.100.1 255.255.255.255
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#rou
Router(config-if)#route
Router(config-if)#exit
Router(config)#rou
Router(config)#router os
Router(config)#router ospf 1
Task:
Перечислим сети, которые подключены к нашему маршрутизатору
Decision:
Router(config-router)#network 192.168.10.0 0.0.0.255 are
Router(config-router)#network 192.168.10.0 0.0.0.255 area 0
Router(config-router)#network 192.168.20.0 0.0.0.255 area 0
Router(config-router)#network 192.168.1.0 0.0.0.3 area 0
Router(config-router)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Task:
Делаем тоже самое для Router2
Decision:
    Router2 - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#in
Router(config)#interface loo
Router(config)#interface loopback 0
Router(config-if)#
    %LINK-5-CHANGED: Interface Loopback0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up
Router(config-if)#ip add
Router(config-if)#ip address 192.168.100.2 255.255.255.255
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#rou
Router(config)#router osp
Router(config)#router ospf 1
Router(config-router)#net
Router(config-router)#network 192.168.30.0 0.0.0.255 area 0
Router(config-router)#network 192.168.40.0 0.0.0.255 area 0
Router(config-router)#network 192.168.2.0 0.0.0.3 area 0
Router(config-router)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Task:
В зданиях мы настроили роутеры 1 и 2, теперь нужно настроить центральный роутер. У него также три интерфейса, но есть 1 интерфейс, который смотрит в сторону провайдера и здесь используются белые ip адреса. его не нужно включать в ospf, так как наш провайдер все равно принимать пакеты динамической маршрутизации не будет
Decision:
    Router0 - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#in
Router(config)#interface loo
Router(config)#interface loopback 0
Router(config-if)#
    %LINK-5-CHANGED: Interface Loopback0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface Loopback0, changed state to up
Router(config-if)#ip add
Router(config-if)#ip address 192.168.100.3 255.255.255.255
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#exit
Router(config)#rout
Router(config)#router os
Router(config)#router ospf 1
Router(config-router)#netw
Router(config-router)#network 192.168.1.0 0.0.0.3 area 0
Router(config-router)#network 192.168.2.0 0.0.0.3 area 0
Router(config-router)#
    00:33:15: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.100.1 on GigabitEthernet0/1 from LOADING to FULL, Loading Done
    00:33:19: %OSPF-5-ADJCHG: Process 1, Nbr 192.168.100.2 on GigabitEthernet0/2 from LOADING to FULL, Loading Done
Router(config-router)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#show ip is
Router#show ip os
Router#show ip ospf ne
Router#show ip ospf neighbor
    Neighbor ID     Pri   State           Dead Time   Address         Interface
    192.168.100.1     1   FULL/DR         00:00:35    192.168.1.2     GigabitEthernet0/1
    192.168.100.2     1   FULL/DR         00:00:30    192.168.2.2     GigabitEthernet0/2
Router#
Router#show ip route
    Codes: L - local, C - connected, S - static, R - RIP, M - mobile, B - BGP
           D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
           N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
           E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
           i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
           * - candidate default, U - per-user static route, o - ODR
           P - periodic downloaded static route
    Gateway of last resort is not set
         192.168.1.0/24 is variably subnetted, 2 subnets, 2 masks
    C       192.168.1.0/30 is directly connected, GigabitEthernet0/1
    L       192.168.1.1/32 is directly connected, GigabitEthernet0/1
         192.168.2.0/24 is variably subnetted, 2 subnets, 2 masks
    C       192.168.2.0/30 is directly connected, GigabitEthernet0/2
    L       192.168.2.1/32 is directly connected, GigabitEthernet0/2
    O    192.168.10.0/24 [110/2] via 192.168.1.2, 00:01:24, GigabitEthernet0/1
    O    192.168.20.0/24 [110/2] via 192.168.1.2, 00:01:24, GigabitEthernet0/1
    O    192.168.30.0/24 [110/2] via 192.168.2.2, 00:01:24, GigabitEthernet0/2
    O    192.168.40.0/24 [110/2] via 192.168.2.2, 00:01:24, GigabitEthernet0/2
         192.168.100.0/32 is subnetted, 1 subnets
    C       192.168.100.3/32 is directly connected, Loopback0

    Router2 - CLI
Router>en
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#show ip rou
Router#show ip route
    Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
           D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
           N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
           E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
           i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
           * - candidate default, U - per-user static route, o - ODR
           P - periodic downloaded static route
    Gateway of last resort is not set
         192.168.1.0/30 is subnetted, 1 subnets
    O       192.168.1.0 [110/2] via 192.168.2.1, 00:03:51, FastEthernet0/0
         192.168.2.0/30 is subnetted, 1 subnets
    C       192.168.2.0 is directly connected, FastEthernet0/0
    O    192.168.10.0/24 [110/3] via 192.168.2.1, 00:03:51, FastEthernet0/0
    O    192.168.20.0/24 [110/3] via 192.168.2.1, 00:03:51, FastEthernet0/0
    C    192.168.30.0/24 is directly connected, FastEthernet0/1.30
    C    192.168.40.0/24 is directly connected, FastEthernet0/1.40
         192.168.100.0/32 is subnetted, 1 subnets
    C       192.168.100.2 is directly connected, Loopback0

    PC-PT VLAN40 - Desktop - ip configuration - ip address 192.168.40.2 - subnet 255.255.255.0 - gateway 192.168.40.1 - PC-PT VLAN10 - Desktop - ip configuration - ip address 192.168.10.2 - subnet 255.255.255.0 - gateway 192.168.10.1 - PC-PT VLAN20 - Desktop - ip configuration - ip address 192.168.20.2 - subnet 255.255.255.0 - gateway 192.168.20.1 - PC-PT VLAN30 - Desktop - ip configuration - ip address 192.168.30.2 - subnet 255.255.255.0 - gateway 192.168.30.1 - command prompt -
C:\>ping 192.168.10.2
    Pinging 192.168.10.2 with 32 bytes of data:
    Request timed out.
    Reply from 192.168.10.2: bytes=32 time=11ms TTL=125
    Reply from 192.168.10.2: bytes=32 time<1ms TTL=125
    Reply from 192.168.10.2: bytes=32 time<1ms TTL=125
    Ping statistics for 192.168.10.2:
        Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 11ms, Average = 3ms
C:\>ping 192.168.20.2
    Pinging 192.168.20.2 with 32 bytes of data:
    Request timed out.
    Reply from 192.168.20.2: bytes=32 time=1ms TTL=125
    Reply from 192.168.20.2: bytes=32 time<1ms TTL=125
    Reply from 192.168.20.2: bytes=32 time=149ms TTL=125
    Ping statistics for 192.168.20.2:
        Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 149ms, Average = 50ms
Task:
Мы добавили маршруты только локальных сетей. А нам необоходим выход в интернет. Надо про писать default gateway в сторону интернет провайдера
Decision:
    Router0 - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip rout
Router(config)#ip route 0.0.0.0 0.0.0.0 210.214.1.1
Task:
Маршрут мы прописали, теперь надо сообщить об этом 2м другим маршрутизаторам
Decision:
Router(config)#rou
Router(config)#router os
Router(config)#router ospf 1
Router(config-router)#de
Router(config-router)#default-information ?
      originate  Distribute a default route
Router(config-router)#default-information oi
Router(config-router)#default-information or
Router(config-router)#default-information originate
Router(config-router)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    Router1 - CLI
Router#show ip route
    Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
           D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
           N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
           E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
           i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
           * - candidate default, U - per-user static route, o - ODR
           P - periodic downloaded static route
    Gateway of last resort is 192.168.1.1 to network 0.0.0.0
         192.168.1.0/30 is subnetted, 1 subnets
    C       192.168.1.0 is directly connected, FastEthernet0/0
         192.168.2.0/30 is subnetted, 1 subnets
    O       192.168.2.0 [110/2] via 192.168.1.1, 00:43:30, FastEthernet0/0
    C    192.168.10.0/24 is directly connected, FastEthernet0/1.10
    C    192.168.20.0/24 is directly connected, FastEthernet0/1.20
    O    192.168.30.0/24 [110/3] via 192.168.1.1, 00:43:30, FastEthernet0/0
    O    192.168.40.0/24 [110/3] via 192.168.1.1, 00:43:30, FastEthernet0/0
         192.168.100.0/32 is subnetted, 1 subnets
    C       192.168.100.1 is directly connected, Loopback0
    O*E2 0.0.0.0/0 [110/1] via 192.168.1.1, 00:02:07, FastEthernet0/0
Task:
Настроим в центральном маршрутизаторе NAT
Decision:
    Route0 - CLI
Router#show run
    Building configuration...
    Current configuration : 993 bytes
    !
    version 15.1
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Router
    !
    !
    !
    !
    !
    !
    !
    !
    ip cef
    no ipv6 cef
    !
    !
    !
    !
    license udi pid CISCO2911/K9 sn FTX1524GHMH-
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface Loopback0
     ip address 192.168.100.3 255.255.255.255
    !
    interface GigabitEthernet0/0
     ip address 210.214.1.2 255.255.255.252
     duplex auto
     speed auto
    !
    interface GigabitEthernet0/1
     ip address 192.168.1.1 255.255.255.252
     duplex auto
     speed auto
    !
    interface GigabitEthernet0/2
     ip address 192.168.2.1 255.255.255.252
     duplex auto
     speed auto
    !
    interface Vlan1
     no ip address
     shutdown
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int
Router(config)#interface gi
Router(config)#interface gigabitEthernet 0/0
Router(config-if)#ip nat outside
Router(config-if)#exit
Router(config)#interface gigabitEthernet 0/1
Router(config-if)#ip nat inside
Router(config-if)#exit
Router(config)#interface gigabitEthernet 0/2
Router(config-if)#ip nat inside
Router(config-if)#exit
Router(config)#ip acc
Router(config)#ip access-list ?
      extended  Extended Access List
      standard  Standard Access List
Router(config)#ip access-list st
Router(config)#ip access-list standard FOR-NAT
Router(config-std-nacl)#permit ?
      A.B.C.D  Address to match
      any      Any source host
      host     A single host address
Router(config-std-nacl)#permit 192.168.10.0 0.0.0.255
Router(config-std-nacl)#permit 192.168.20.0 0.0.0.255
Router(config-std-nacl)#permit 192.168.30.0 0.0.0.255
Router(config-std-nacl)#permit 192.168.40.0 0.0.0.255
Router(config-std-nacl)#exit
Router(config)#ip nat inside sou
Router(config)#ip nat inside source list F
Router(config)#ip nat inside source list FOR-NAT ?
      interface  Specify interface for global address
      pool       Name pool of global addresses
Router(config)#ip nat inside source list FOR-NAT in
Router(config)#ip nat inside source list FOR-NAT interface g
Router(config)#ip nat inside source list FOR-NAT interface gigabitEthernet 0/0 ?
      overload  Overload an address translation
      <cr>
Router(config)#ip nat inside source list FOR-NAT interface gigabitEthernet 0/0 over
Router(config)#ip nat inside source list FOR-NAT interface gigabitEthernet 0/0 overload
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    Server0 - Desktop - ip configuration - ip address 210.214.2.2 - default gateway 210.214.2.1 - PC-PT VLAN10 - Desktop - Command prompt
C:\>ping 210.214.2.2
    Pinging 210.214.2.2 with 32 bytes of data:
    Request timed out.
    Request timed out.
    Reply from 210.214.2.2: bytes=32 time=13ms TTL=125
    Reply from 210.214.2.2: bytes=32 time<1ms TTL=125
    Ping statistics for 210.214.2.2:
        Packets: Sent = 4, Received = 2, Lost = 2 (50% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 13ms, Average = 6ms

    Router0 - CLI  
Router#show ip nat translations
    Pro  Inside global     Inside local       Outside local      Outside global
    icmp 210.214.1.2:1     192.168.10.2:1     210.214.2.2:1      210.214.2.2:1
    icmp 210.214.1.2:2     192.168.10.2:2     210.214.2.2:2      210.214.2.2:2
    icmp 210.214.1.2:3     192.168.10.2:3     210.214.2.2:3      210.214.2.2:3
    icmp 210.214.1.2:4     192.168.10.2:4     210.214.2.2:4      210.214.2.2:4
    icmp 210.214.1.2:5     192.168.10.2:5     210.214.2.2:5      210.214.2.2:5
    icmp 210.214.1.2:6     192.168.10.2:6     210.214.2.2:6      210.214.2.2:6
    icmp 210.214.1.2:7     192.168.10.2:7     210.214.2.2:7      210.214.2.2:7
    icmp 210.214.1.2:8     192.168.10.2:8     210.214.2.2:8      210.214.2.2:8
Task:
we will set up communication between the two offices via routing. In the 1st office there are 3 Vlans that are routed by one router. The second office has 2 Vlan users and one Vlan servers. In it, all routing is carried out by the L3 switch

a router was also added to it. Let's run it and see that the L3 switch is pinged, and the computer is not:

    Router1 - CLI
Router>en
Router#show run
    ...
    interface GigabitEthernet0/0
     ip address 192.168.55.1 255.255.255.0
     duplex auto
     speed auto
    !
    interface GigabitEthernet0/1
    ...
Router#ping 192.168.55.2
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 192.168.55.2, timeout is 2 seconds:
    .!!!!
    Success rate is 80 percent (4/5), round-trip min/avg/max = 0/0/0 ms
Router#ping 192.168.22.2
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 192.168.22.2, timeout is 2 seconds:
    .....
    Success rate is 0 percent (0/5)
Значит, нам нужно прописать маршруты, что данные компьютеры доступны только через L3 коммутаторы.
Decision:
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip route 192.168.22.0 255.255.255.0 192.168.55.2
Router(config)#ip route 192.168.33.0 255.255.255.0 192.168.55.2
Router(config)#ip route 192.168.44.0 255.255.255.0 192.168.55.2
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#ping 192.168.22.2
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 192.168.22.2, timeout is 2 seconds:
    !!!!!
    Success rate is 100 percent (5/5), round-trip min/avg/max = 0/0/0 ms
Router#ping 192.168.33.2
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 192.168.33.2, timeout is 2 seconds:
    !!!!!
    Success rate is 100 percent (5/5), round-trip min/avg/max = 0/2/12 ms
Router#ping 192.168.44.2
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 192.168.44.2, timeout is 2 seconds:
    !!!!!
    Success rate is 100 percent (5/5), round-trip min/avg/max = 0/6/33 ms
Task:
Соединим 2 маршрутизатора. пусть у нас есть прямой линк. На роутере 2911 нужно настроить GigabitEthernet01
Decision:
    Router1-CLI
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int gi
Router(config)#int gigabitEthernet 0/1
Router(config-if)#no shu
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/1, changed state to up
Router(config-if)#ip ad
Router(config-if)#ip address 192.168.70.1 255.255.255.252
Router(config-if)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    Router0-CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa
Router(config)#int fastEthernet 0/1
Router(config-if)#no shu
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up
Router(config-if)#ip address 192.168.70.2 255.255.255.252
Router(config-if)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#ping 192.168.70.1
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 192.168.70.1, timeout is 2 seconds:
    .!!!!
    Success rate is 80 percent (4/5), round-trip min/avg/max = 0/0/0 ms
Task:
Пропинговав компьютеры c двух офисов увидим, что они друг с другом не пингуются. Для этого нужно прописать маршрут в маршрутизаторах route0,1 до самих компов. То есть нужно прописать на роутерах маршрут по умолчанию
Decision:
    PC0-Desktop-command prompt
C:\>ping 192.168.22.2
    Pinging 192.168.22.2 with 32 bytes of data:
    Reply from 192.168.2.1: Destination host unreachable.
    Reply from 192.168.2.1: Destination host unreachable.
    Reply from 192.168.2.1: Destination host unreachable.
    Reply from 192.168.2.1: Destination host unreachable.
    Ping statistics for 192.168.22.2:
        Packets: Sent = 4, Received = 0, Lost = 4 (100% loss),

    Route0-CLI
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip route 0.0.0.0 0.0.0.0 192.168.70.1
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#show ip route
    Codes: C - connected, S - static, I - IGRP, R - RIP, M - mobile, B - BGP
           D - EIGRP, EX - EIGRP external, O - OSPF, IA - OSPF inter area
           N1 - OSPF NSSA external type 1, N2 - OSPF NSSA external type 2
           E1 - OSPF external type 1, E2 - OSPF external type 2, E - EGP
           i - IS-IS, L1 - IS-IS level-1, L2 - IS-IS level-2, ia - IS-IS inter area
           * - candidate default, U - per-user static route, o - ODR
           P - periodic downloaded static route
    Gateway of last resort is 192.168.70.1 to network 0.0.0.0
    C    192.168.2.0/24 is directly connected, FastEthernet0/0.2
    C    192.168.3.0/24 is directly connected, FastEthernet0/0.3
    C    192.168.4.0/24 is directly connected, FastEthernet0/0.4
         192.168.70.0/30 is subnetted, 1 subnets
    C       192.168.70.0 is directly connected, FastEthernet0/1
    S*   0.0.0.0/0 [1/0] via 192.168.70.1

    Switch0-CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#ip route 0.0.0.0 0.0.0.0 192.168.55.1
Switch(config)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]

    Router1 - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip route 0.0.0.0 0.0.0.0 192.168.55.1
    %Invalid next hop address (it's this router)
Router(config)#
Router(config)#ip route 192.168.2.0 255.255.255.0 192.168.70.2
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#ping 192.168.2.2
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 192.168.2.2, timeout is 2 seconds:
    !!!!!
    Success rate is 100 percent (5/5), round-trip min/avg/max = 0/1/6 ms

    PC0-Desktop-command prompt
C:\>ping 192.168.22.2
    Pinging 192.168.22.2 with 32 bytes of data:
    Reply from 192.168.22.2: bytes=32 time=59ms TTL=125
    Reply from 192.168.22.2: bytes=32 time<1ms TTL=125
    Reply from 192.168.22.2: bytes=32 time=49ms TTL=125
    Reply from 192.168.22.2: bytes=32 time=23ms TTL=125
    Ping statistics for 192.168.22.2:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 59ms, Average = 32ms
Task:
из PC1 пинговаться не будет. Нужно настроить. Пропишем адреса для всех компов в роутерах
Decision:
    Router1 - CLI
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip route 192.168.32.0 255.255.255.0 192.168.70.2
Router(config)#no ip route 192.168.32.0 255.255.255.0 192.168.70.2
Router(config)#ip route 192.168.3.0 255.255.255.0 192.168.70.2
Router(config)#ip route 192.168.4.0 255.255.255.0 192.168.70.2
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    PC1-Desktop-command prompt
C:\>ping 192.168.22.2
    Pinging 192.168.22.2 with 32 bytes of data:
    Reply from 192.168.22.2: bytes=32 time<1ms TTL=125
    Reply from 192.168.22.2: bytes=32 time=15ms TTL=125
    Reply from 192.168.22.2: bytes=32 time<1ms TTL=125
    Reply from 192.168.22.2: bytes=32 time=12ms TTL=125
    Ping statistics for 192.168.22.2:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 15ms, Average = 6ms

Task:
Усложним задачу и поставим еще один роутер (1841 Route2) вместо прямого кабеля между маршрутизаторами Route1 и Route0
Decision:
    Router2-CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa
Router(config)#int fastEthernet 0/0
Router(config-if)#no shu
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
Router(config-if)#ip add
Router(config-if)#ip address 192.168.70.1 255.255.255.0
Router(config-if)#exit
Router(config)#int fastEthernet 0/1
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up
Router(config-if)#ip address 192.168.80.1 255.255.255.0
Router(config-if)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    Router0-CLI
Router>en
Router#show run
    ...
    interface FastEthernet0/0
     no ip address
     duplex auto
     speed auto
    !
    interface FastEthernet0/0.2
     encapsulation dot1Q 2
     ip address 192.168.2.1 255.255.255.0
    !
    interface FastEthernet0/0.3
     encapsulation dot1Q 3
     ip address 192.168.3.1 255.255.255.0
    !
    interface FastEthernet0/0.4
     encapsulation dot1Q 4
     ip address 192.168.4.1 255.255.255.0
    !
    interface FastEthernet0/1
     ip address 192.168.70.2 255.255.255.252
     duplex auto
     speed auto
    !
    interface Vlan1
     no ip address
     shutdown
    !
    ip classless
    ip route 0.0.0.0 0.0.0.0 192.168.70.1
    !
    ip flow-export version 9
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa
Router(config)#int fastEthernet 0/1
Router(config-if)#ip ad
Router(config-if)#ip address 192.168.70.2 255.255.255.0
Router(config-if)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#show run
    ...
    interface FastEthernet0/0
     no ip address
     duplex auto
     speed auto
    !
    interface FastEthernet0/0.2
     encapsulation dot1Q 2
     ip address 192.168.2.1 255.255.255.0
    !
    interface FastEthernet0/0.3
     encapsulation dot1Q 3
     ip address 192.168.3.1 255.255.255.0
    !
    interface FastEthernet0/0.4
     encapsulation dot1Q 4
     ip address 192.168.4.1 255.255.255.0
    !
    interface FastEthernet0/1
     ip address 192.168.70.2 255.255.255.0
     duplex auto
     speed auto
    !

    Router1-CLI
Router>en
Router#show run
    ...
    interface GigabitEthernet0/0
     ip address 192.168.55.1 255.255.255.0
     duplex auto
     speed auto
    !
    interface GigabitEthernet0/1
     ip address 192.168.70.1 255.255.255.252
     duplex auto
     speed auto
    !
    interface GigabitEthernet0/2
     no ip address
     duplex auto
     speed auto
     shutdown
    !
    interface Vlan1
     no ip address
     shutdown
    !
    ip classless
    ip route 192.168.22.0 255.255.255.0 192.168.55.2
    ip route 192.168.33.0 255.255.255.0 192.168.55.2
    ip route 192.168.44.0 255.255.255.0 192.168.55.2
    ip route 192.168.2.0 255.255.255.0 192.168.70.2
    ip route 192.168.3.0 255.255.255.0 192.168.70.2
    ip route 192.168.4.0 255.255.255.0 192.168.70.2
    !
Router#int gi
Router#int gig
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int gi
Router(config)#int gigabitEthernet 0/1
Router(config-if)#ip add
Router(config-if)#ip address 192.168.80.2 255.255.255.0
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#no ip route 192.168.2.0 255.255.255.0 192.168.70.2
Router(config)#no ip route 192.168.3.0 255.255.255.0 192.168.70.2
Router(config)#no ip route 192.168.4.0 255.255.255.0 192.168.70.2
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#ping 192.168.80.1
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 192.168.80.1, timeout is 2 seconds:
    .!!!!
    Success rate is 80 percent (4/5), round-trip min/avg/max = 0/0/0 ms
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip route 0.0.0.0 0.0.0.0 192.168.80.1
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    Router2-CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#ip route 192.168.2.0 255.255.255.0 192.168.70.2
Router(config)#ip route 192.168.3.0 255.255.255.0 192.168.70.2
Router(config)#ip route 192.168.4.0 255.255.255.0 192.168.70.2
Router(config)#ip route 192.168.44.0 255.255.255.0 192.168.80.2
Router(config)#ip route 192.168.33.0 255.255.255.0 192.168.80.2
Router(config)#ip route 192.168.22.0 255.255.255.0 192.168.80.2
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]

    PC0-Desktop-command prompt
C:\>ping 192.168.44.2
    Pinging 192.168.44.2 with 32 bytes of data:
    Request timed out.
    Reply from 192.168.44.2: bytes=32 time=12ms TTL=124
    Reply from 192.168.44.2: bytes=32 time=13ms TTL=124
    Reply from 192.168.44.2: bytes=32 time=10ms TTL=124
    Ping statistics for 192.168.44.2:
        Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 10ms, Maximum = 13ms, Average = 11ms
C:\>ping 192.168.33.2
    Pinging 192.168.33.2 with 32 bytes of data:
    Reply from 192.168.33.2: bytes=32 time=65ms TTL=124
    Reply from 192.168.33.2: bytes=32 time=10ms TTL=124
    Reply from 192.168.33.2: bytes=32 time=10ms TTL=124
    Reply from 192.168.33.2: bytes=32 time=13ms TTL=124
    Ping statistics for 192.168.33.2:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 10ms, Maximum = 65ms, Average = 24ms
C:\>ping 192.168.22.2
    Pinging 192.168.22.2 with 32 bytes of data:
    Reply from 192.168.22.2: bytes=32 time=10ms TTL=124
    Reply from 192.168.22.2: bytes=32 time=24ms TTL=124
    Reply from 192.168.22.2: bytes=32 time=17ms TTL=124
    Reply from 192.168.22.2: bytes=32 time=21ms TTL=124
    Ping statistics for 192.168.22.2:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 10ms, Maximum = 24ms, Average = 18ms

Task:
Consider the case of a small office that consists of several computers and one switch. With very little local traffic and no dedicated local servers, we do not need to install three switches. One router is enough, which is able to organize access for users (computers) to the Internet. Let's say we have three segments (vlan2,3,4). With the help of a router, you need to organize traffic routing between 3 segments without using 3 switches
Decision:
    Switch0 - CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 2
Switch(config-vlan)#name vlan2
Switch(config-vlan)#exit
Switch(config)#vlan 3
Switch(config-vlan)#name vlan3
Switch(config-vlan)#exit
Switch(config)#vlan 4
Switch(config-vlan)#name vlan4
Switch(config-vlan)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int fa
Switch(config)#int fastEthernet 0/1
Switch(config-if)#swi
Switch(config-if)#switchport mod ac
Switch(config-if)#switchport mod access
Switch(config-if)#switchport ac
Switch(config-if)#switchport access vl
Switch(config-if)#switchport access vlan 2
Switch(config-if)#exit
Switch(config)#int fastEthernet 0/2
Switch(config-if)#switchport mod access
Switch(config-if)#switchport access vlan 3
Switch(config-if)#exit
Switch(config)#int fastEthernet 0/3
Switch(config-if)#switchport mod access
Switch(config-if)#switchport access vlan 4
Switch(config-if)#exit
Task:
Теперь необходимо настроить trunk порт, который идет до маршрутизатора router0
Decision:
Switch(config)#int fastEthernet 0/4
Switch(config-if)#switchport mod tr
Switch(config-if)#switchport mode trunk
Switch(config-if)#switchport trunk all
Switch(config-if)#switchport trunk allowed vlan 2,3,4
Switch(config-if)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]
Task:
Переходим к настройке нашего маршрутизатора и нужно в первую очередь поднять физический порт. Также необходимо создать подинтерфейсы
Decision:
    Router0 - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa
Router(config)#int fastEthernet 0/0
Router(config-if)#no shu
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
Router(config-if)#exit
Router(config)#interfa
Router(config)#interface fa
Router(config)#interface fastEthernet 0/0.2
Router(config-subif)#
    %LINK-5-CHANGED: Interface FastEthernet0/0.2, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0.2, changed state to up
Router(config-subif)#en
Router(config-subif)#encapsulation dot1
Router(config-subif)#encapsulation dot1Q 2
Router(config-subif)#ip add
Router(config-subif)#ip address 192.168.2.1 255.255.255.0
Router(config-subif)#no shutdown
Router(config-subif)#exit
Router(config)#interface fastEthernet 0/0.3
Router(config-subif)#
    %LINK-5-CHANGED: Interface FastEthernet0/0.3, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0.3, changed state to up
Router(config-subif)#encapsulation dot1Q 3
Router(config-subif)#ip address 192.168.3.1 255.255.255.0
Router(config-subif)#no shutdown
Router(config-subif)#exit
Router(config)#interface fastEthernet 0/0.4
Router(config-subif)#
    %LINK-5-CHANGED: Interface FastEthernet0/0.4, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0.4, changed state to up
Router(config-subif)#encapsulation dot1Q 4
Router(config-subif)#ip address 192.168.4.1 255.255.255.0
Router(config-subif)#no shutdown
Router(config-subif)#exit
Router(config)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#wr mem
    Building configuration...
    [OK]
Router#show run
    Building configuration...
    Current configuration : 816 bytes
    !
    version 12.4
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Router
    !
    !
    !
    !
    !
    !
    !
    !
    ip cef
    no ipv6 cef
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface FastEthernet0/0
     no ip address
     duplex auto
     speed auto
    !
    interface FastEthernet0/0.2
     encapsulation dot1Q 2
     ip address 192.168.2.1 255.255.255.0
    !
    interface FastEthernet0/0.3
     encapsulation dot1Q 3
     ip address 192.168.3.1 255.255.255.0
    !
    interface FastEthernet0/0.4
     encapsulation dot1Q 4
     ip address 192.168.4.1 255.255.255.0
    !
Task:
Проверим
Decision:
    PC0 - Desktop - IP confihuration - IP address:192.168.2.2 - Subnet:255.255.255.0 - Default Gateway:192.168.2.1 - PC1 - Desktop - IP confihuration - IP address:192.168.3.2 - Subnet:255.255.255.0 - Default Gateway:192.168.3.1 - PC2 - Desktop - IP confihuration - IP address:192.168.4.2 - Subnet:255.255.255.0 - Default Gateway:192.168.4.1 - Command Prompt
C:\>ping 192.168.4.1
    Pinging 192.168.4.1 with 32 bytes of data:
    Reply from 192.168.4.1: bytes=32 time<1ms TTL=255
    Reply from 192.168.4.1: bytes=32 time<1ms TTL=255
    Reply from 192.168.4.1: bytes=32 time=1ms TTL=255
    Reply from 192.168.4.1: bytes=32 time<1ms TTL=255
    Ping statistics for 192.168.4.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 1ms, Average = 0ms
C:\>ping 192.168.3.2
    Pinging 192.168.3.2 with 32 bytes of data:
    Request timed out.
    Reply from 192.168.3.2: bytes=32 time=11ms TTL=127
    Reply from 192.168.3.2: bytes=32 time=1ms TTL=127
    Reply from 192.168.3.2: bytes=32 time=1ms TTL=127
    Ping statistics for 192.168.3.2:
        Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 1ms, Maximum = 11ms, Average = 4ms
C:\>ping 192.168.3.2
    Pinging 192.168.3.2 with 32 bytes of data:
    Reply from 192.168.3.2: bytes=32 time<1ms TTL=127
    Reply from 192.168.3.2: bytes=32 time<1ms TTL=127
    Reply from 192.168.3.2: bytes=32 time<1ms TTL=127
    Reply from 192.168.3.2: bytes=32 time<1ms TTL=127
    Ping statistics for 192.168.3.2:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 0ms, Average = 0ms
C:\>ping 192.168.2.2
    Pinging 192.168.2.2 with 32 bytes of data:
    Request timed out.
    Reply from 192.168.2.2: bytes=32 time=12ms TTL=127
    Reply from 192.168.2.2: bytes=32 time=12ms TTL=127
    Reply from 192.168.2.2: bytes=32 time=1ms TTL=127
    Ping statistics for 192.168.2.2:
        Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 1ms, Maximum = 12ms, Average = 8ms
Task:
Рассмотрим пример, когда у нас есть несколько коммутаторов уроней доступа и сотни компьютеров, а также присутсвуют выделенные серверы.
Decision:
    Switch1 - CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 2
Switch(config-vlan)#name vlan2
Switch(config-vlan)#exit
Switch(config)#vlan 3
Switch(config-vlan)#name vlan3
Switch(config-vlan)#exit
Switch(config)#int f
Switch(config)#int fastEthernet 0/1
Switch(config-if)#swit
Switch(config-if)#switc
Switch(config-if)#switchport mo
Switch(config-if)#switchport mode acc
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 2
Switch(config-if)#exit
Switch(config)#int fastEthernet 0/2
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 3
Switch(config-if)#int fastEthernet 0/3
Switch(config-if)#exit
Switch(config)#int fastEthernet 0/3
Switch(config-if)#switchport mode trunk
Switch(config-if)#
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to down
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to up
Switch(config-if)#switchport trun
Switch(config-if)#switchport trunk all
Switch(config-if)#switchport trunk allowed vlan 2,3
Switch(config-if)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]
Switch#show run
    Building configuration...
    Current configuration : 1238 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface FastEthernet0/1
     switchport access vlan 2
     switchport mode access
    !
    interface FastEthernet0/2
     switchport access vlan 3
     switchport mode access
    !
    interface FastEthernet0/3
     switchport trunk allowed vlan 2-3
     switchport mode trunk
    !

    Switch2 - CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 2
Switch(config-vlan)#name vlan2
Switch(config-vlan)#exit
Switch(config)#vlan 3
Switch(config-vlan)#name vlan3
Switch(config-vlan)#exit
Switch(config)#int fa
Switch(config)#int fastEthernet 0/1
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vl
Switch(config-if)#switchport access vlan 2
Switch(config-if)#exit
Switch(config)#int fastEthernet 0/2
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 3
Switch(config-if)#exit
Switch(config)#int fastEthernet 0/3
Switch(config-if)#switchport mode tru
Switch(config-if)#switchport mode trunk
Switch(config-if)#
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to down
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to up
Switch(config-if)#switchport trunk all
Switch(config-if)#switchport trunk allowed vl
Switch(config-if)#switchport trunk allowed vlan 2,3
Switch(config-if)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]
Switch#show run
    Building configuration...
    Current configuration : 1238 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface FastEthernet0/1
     switchport access vlan 2
     switchport mode access
    !
    interface FastEthernet0/2
     switchport access vlan 3
     switchport mode access
    !
    interface FastEthernet0/3
     switchport trunk allowed vlan 2-3
     switchport mode trunk
    !

    Switch 3 - CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 4
Switch(config-vlan)#name vlan4
Switch(config-vlan)#exit
Switch(config)#int fa
Switch(config)#int fastEthernet 0/1
Switch(config-if)#sw
Switch(config-if)#switchport mo
Switch(config-if)#switchport mode acc
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vla
Switch(config-if)#switchport access vlan 4
Switch(config-if)#exit
Switch(config)#int fastEthernet 0/2
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 4
Switch(config-if)#exit
Switch(config)#int fastEthernet 0/3
Switch(config-if)#switchport mode trunk
Switch(config-if)#
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to down
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/3, changed state to up
Switch(config-if)#switchport tr
Switch(config-if)#switchport trunk all
Switch(config-if)#switchport trunk allowed vl
Switch(config-if)#switchport trunk allowed vlan 4
Switch(config-if)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]

    PC3 - Desktop - IP confihuration - IP address:192.168.22.2 - Subnet:255.255.255.0 - Default Gateway:192.168.22.1 -
    PC4 - Desktop - IP confihuration - IP address:192.168.33.2 - Subnet:255.255.255.0 - Default Gateway:192.168.33.1 -
    PC5 - Desktop - IP confihuration - IP address:192.168.22.3 - Subnet:255.255.255.0 - Default Gateway:192.168.22.1 -
    PC6 - Desktop - IP confihuration - IP address:192.168.33.3 - Subnet:255.255.255.0 - Default Gateway:192.168.33.1 -
    Server0 - Desktop - IP confihuration - IP address:192.168.44.2 - Subnet:255.255.255.0 - Default Gateway:192.168.44.1 -
    Server1 - Desktop - IP confihuration - IP address:192.168.44.3 - Subnet:255.255.255.0 - Default Gateway:192.168.44.1

    Multiplayer Switch0 - CLI
Switch#en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)# ip routing
Switch(config)#int fastEthernet 0/1
Switch(config-if)#switchport trunk allowed vlan 2,3
Switch(config-if)#switchport trunk encapsulation dot1q
Switch(config-if)#exit
Switch(config)#int fastEthernet 0/2
Switch(config-if)#switchport trunk allowed vlan 2,3
Switch(config-if)#switchport trunk encapsulation dot1q
Switch(config-if)#exit
Switch(config)#int fastEthernet 0/3
Switch(config-if)#switchport trunk allowed vlan 4
Switch(config-if)#switchport trunk encapsulation dot1q
Switch(config-if)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
wr mem
    Building configuration...
    [OK]
Switch(config)#vlan 2  
Switch(config-vlan)#int vlan 2
Switch(config-if)#ip ad
Switch(config-if)#ip address 192.168.22.1 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#exit
Switch(config)#vlan 3
Switch(config-vlan)#int vlan 3
Switch(config-if)#ip address 192.168.33.1 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#exit
Switch(config)#vlan 4  
Switch(config-vlan)#int vlan 4
Switch(config-if)#ip address 192.168.44.1 255.255.255.0
Switch(config-if)#no shutdown
Switch(config-if)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]
Switch#show run
    Building configuration...
    Current configuration : 1608 bytes
    !
    version 12.2(37)SE1
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface FastEthernet0/1
     switchport trunk allowed vlan 2-3
     switchport trunk encapsulation dot1q
    !
    interface FastEthernet0/2
     switchport trunk allowed vlan 2-3
     switchport trunk encapsulation dot1q
    !
    interface FastEthernet0/3
     switchport trunk allowed vlan 4
     switchport trunk encapsulation dot1q
    !
    interface FastEthernet0/4
    !
    interface FastEthernet0/5
    !
    interface FastEthernet0/6
    !
    interface FastEthernet0/7
    !
    interface FastEthernet0/8
    !
    interface FastEthernet0/9
    !
    interface FastEthernet0/10
    !
    interface FastEthernet0/11
    !
    interface FastEthernet0/12
    !
    interface FastEthernet0/13
    !
    interface FastEthernet0/14
    !
    interface FastEthernet0/15
    !
    interface FastEthernet0/16
    !
    interface FastEthernet0/17
    !
    interface FastEthernet0/18
    !
    interface FastEthernet0/19
    !
    interface FastEthernet0/20
    !
    interface FastEthernet0/21
    !
    interface FastEthernet0/22
    !
    interface FastEthernet0/23
    !
    interface FastEthernet0/24
    !
    interface GigabitEthernet0/1
    !
    interface GigabitEthernet0/2
    !
    interface Vlan1
     no ip address
     shutdown
    !
    interface Vlan2
     mac-address 0060.3ec1.d101
     ip address 192.168.22.1 255.255.255.0
    !
    interface Vlan3
     mac-address 0060.3ec1.d102
     ip address 192.168.33.1 255.255.255.0
    !
    interface Vlan4
     mac-address 0060.3ec1.d103
     ip address 192.168.44.1 255.255.255.0
    !
    ip classless
    !
    ip flow-export version 9

    PC3 - Desktop - Command Prompt
C:\>ping 192.168.33.3
    Pinging 192.168.33.3 with 32 bytes of data:
    Request timed out.
    Reply from 192.168.33.3: bytes=32 time<1ms TTL=127
    Reply from 192.168.33.3: bytes=32 time=1ms TTL=127
    Reply from 192.168.33.3: bytes=32 time<1ms TTL=127
    Ping statistics for 192.168.33.3:
        Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 1ms, Average = 0ms
C:\>ping 192.168.33.1
    Pinging 192.168.33.1 with 32 bytes of data:
    Reply from 192.168.33.1: bytes=32 time<1ms TTL=255
    Reply from 192.168.33.1: bytes=32 time<1ms TTL=255
    Reply from 192.168.33.1: bytes=32 time<1ms TTL=255
    Reply from 192.168.33.1: bytes=32 time<1ms TTL=255
    Ping statistics for 192.168.33.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 0ms, Average = 0ms
C:\>ping 192.168.44.1
    Pinging 192.168.44.1 with 32 bytes of data:
    Reply from 192.168.44.1: bytes=32 time<1ms TTL=255
    Reply from 192.168.44.1: bytes=32 time=2ms TTL=255
    Reply from 192.168.44.1: bytes=32 time<1ms TTL=255
    Reply from 192.168.44.1: bytes=32 time<1ms TTL=255
    Ping statistics for 192.168.44.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 2ms, Average = 0ms

Task:
Чтобы был доступ в интернет, нужно настроить маршрутизатор (router1). Пусть он будет сегмнетом с vlan5.
Decision:
    Switch0 - CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 5
Switch(config-vlan)#name vlan5
Switch(config-vlan)#exit
Switch(config)#int vlan 5
Switch(config-if)#
    %LINK-5-CHANGED: Interface Vlan5, changed state to up
Switch(config-if)#ip ad
Switch(config-if)#ip address 192.168.55.2 255.255.255.0
Switch(config-if)#no sh
Switch(config-if)#no shutdown
Switch(config-if)#exit
Switch(config)#int gi
Switch(config)#int gi0/1
Switch(config-if)#swit
Switch(config-if)#switchport mode
Switch(config-if)#switchport mode acc
Switch(config-if)#switchport mode access
Switch(config-if)#swi
Switch(config-if)#switchport ac
Switch(config-if)#switchport access vl
Switch(config-if)#switchport access vlan 5
Switch(config-if)#exit
Switch(config)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]
Switch#who
Switch#sh
Switch#show r
Switch#show run
    Building configuration...
    Current configuration : 1780 bytes
    !
    version 12.2(37)SE1
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    ip routing
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface FastEthernet0/1
     switchport trunk allowed vlan 2-3
     switchport trunk encapsulation dot1q
    !
    interface FastEthernet0/2
     switchport trunk allowed vlan 2-3
     switchport trunk encapsulation dot1q
    !
    interface FastEthernet0/3
     switchport trunk allowed vlan 4
     switchport trunk encapsulation dot1q
    !
    interface FastEthernet0/4
    !
    interface FastEthernet0/5
    !
    interface FastEthernet0/6
    !
    interface FastEthernet0/7
    !
    interface FastEthernet0/8
    !
    interface FastEthernet0/9
    !
    interface FastEthernet0/10
    !
    interface FastEthernet0/11
    !
    interface FastEthernet0/12
    !
    interface FastEthernet0/13
    !
    interface FastEthernet0/14
    !
    interface FastEthernet0/15
    !
    interface FastEthernet0/16
    !
    interface FastEthernet0/17
    !
    interface FastEthernet0/18
    !
    interface FastEthernet0/19
    !
    interface FastEthernet0/20
    !
    interface FastEthernet0/21
    !
    interface FastEthernet0/22
    !
    interface FastEthernet0/23
    !
    interface FastEthernet0/24
    !
    interface GigabitEthernet0/1
     switchport access vlan 5
     switchport mode access
     switchport nonegotiate
    !
    interface GigabitEthernet0/2
    !
    interface Vlan1
     no ip address
     shutdown
    !
    interface Vlan2
     mac-address 0060.3ec1.d101
     ip address 192.168.22.1 255.255.255.0
    !
    interface Vlan3
     mac-address 0060.3ec1.d102
     ip address 192.168.33.1 255.255.255.0
    !
    interface Vlan4
     mac-address 0060.3ec1.d103
     ip address 192.168.44.1 255.255.255.0
    !
    interface Vlan5
     mac-address 0060.3ec1.d104
     ip address 192.168.55.2 255.255.255.0
    !

    Route1 - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int g
Router(config)#int gigabitEthernet 0/0
Router(config-if)#no sho
Router(config-if)#no shotd
Router(config-if)#no shut
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up
Router(config-if)#ip add
Router(config-if)#ip address 192.168.55.1 255.255.255.0
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#end
Router#
    %SYS-5-CONFIG_I: Configured from console by console
Router#ping 192.168.55.2
    Type escape sequence to abort.
    Sending 5, 100-byte ICMP Echos to 192.168.55.2, timeout is 2 seconds:
    .!!!!
    Success rate is 80 percent (4/5), round-trip min/avg/max = 0/0/0 ms
Task:
Мы хотим разбить нашу сеть на 3 сегмента (3 Vlan) и чтобы компьютеры могли между собой связываться
Decision:
3560 Switch0 -> CLI
Создаем 3 сегмента (3 Vlan)
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 2
Switch(config-vlan)#name VLAN2
Switch(config-vlan)#exit
Switch(config)#vlan 3
Switch(config-vlan)#name VLAN3
Switch(config-vlan)#exit
Switch(config)#vlan 4
Switch(config-vlan)#name VLAN4
Switch(config-vlan)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#
Определить порты, которые подключаются пользователи в определенный VLAN
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int fa0/1
Switch(config-if)#switc
Switch(config-if)#switchport mod
Switch(config-if)#switchport mode acc
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 2
Switch(config-if)#exit
Switch(config)#int fa0/2
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 3
Switch(config-if)#exit
Switch(config)#int fa0/3
Switch(config-if)#switchport access vlan 4
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 4
Switch(config-if)#exit
Switch(config)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#show run
    Building configuration...
    Current configuration : 1358 bytes
    !
    version 12.2(37)SE1
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface FastEthernet0/1
     switchport access vlan 2
     switchport mode access
     switchport nonegotiate
    !
    interface FastEthernet0/2
     switchport access vlan 3
     switchport mode access
     switchport nonegotiate
    !
    interface FastEthernet0/3
     switchport access vlan 4
     switchport mode access
     switchport nonegotiate
    !
Добавим Ip адреса на созданные нами сегменты
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int vlan 2
Switch(config-if)#
    %LINK-5-CHANGED: Interface Vlan2, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan2, changed state to up
Switch(config-if)#ip addre
Switch(config-if)#ip address 2.2.2.1 255.255.255.0
Switch(config-if)#exit
Switch(config)#int vlan 3
Switch(config-if)#
    %LINK-5-CHANGED: Interface Vlan3, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan3, changed state to up
Switch(config-if)#ip address 3.3.3.1 255.255.255.0
Switch(config-if)#exit
Switch(config)#int vlan 4
Switch(config-if)#
    %LINK-5-CHANGED: Interface Vlan4, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan4, changed state to up
Switch(config-if)#ip address 4.4.4.1 255.255.255.0
Switch(config-if)#end
    %SYS-5-CONFIG_I: Configured from console by console
Switch#show run
    Building configuration...
    Current configuration : 1598 bytes
    !
    version 12.2(37)SE1
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface FastEthernet0/1
     switchport access vlan 2
     switchport mode access
     switchport nonegotiate
    !
    interface FastEthernet0/2
     switchport access vlan 3
     switchport mode access
     switchport nonegotiate
    !
    interface FastEthernet0/3
     switchport access vlan 4
     switchport mode access
     switchport nonegotiate
    !
    interface FastEthernet0/4
    !
    interface FastEthernet0/5
    !
    interface FastEthernet0/6
    !
    interface FastEthernet0/7
    !
    interface FastEthernet0/8
    !
    interface FastEthernet0/9
    !
    interface FastEthernet0/10
    !
    interface FastEthernet0/11
    !
    interface FastEthernet0/12
    !
    interface FastEthernet0/13
    !
    interface FastEthernet0/14
    !
    interface FastEthernet0/15
    !
    interface FastEthernet0/16
    !
    interface FastEthernet0/17
    !
    interface FastEthernet0/18
    !
    interface FastEthernet0/19
    !
    interface FastEthernet0/20
    !
    interface FastEthernet0/21
    !
    interface FastEthernet0/22
    !
    interface FastEthernet0/23
    !
    interface FastEthernet0/24
    !
    interface GigabitEthernet0/1
    !
    interface GigabitEthernet0/2
    !
    interface Vlan1
     no ip address
     shutdown
    !
    interface Vlan2
     mac-address 0002.1644.8301
     ip address 2.2.2.1 255.255.255.0
    !
    interface Vlan3
     mac-address 0002.1644.8302
     ip address 3.3.3.1 255.255.255.0
    !
    interface Vlan4
     mac-address 0002.1644.8303
     ip address 4.4.4.1 255.255.255.0
    !
    ip classless
    !
Switch#
PC-PT PC0,1,2 -> Desktop -> ipconfig -> ip address:2.2.2.2,3.3.3.2,4.4.4.2 -> Mask:255.255.255.0 -> Default Gateway:2.2.2.1,3.3.3.1,4.4.4.1 -> Command prompt
C:\>ping 2.2.2.1
    Pinging 2.2.2.1 with 32 bytes of data:
    Reply from 2.2.2.1: bytes=32 time=20ms TTL=255
    Reply from 2.2.2.1: bytes=32 time<1ms TTL=255
    Reply from 2.2.2.1: bytes=32 time<1ms TTL=255
    Reply from 2.2.2.1: bytes=32 time<1ms TTL=255
    Ping statistics for 2.2.2.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 20ms, Average = 5ms
Проверим межсетевое взаимодействие
C:\>ping 4.4.4.1
    Pinging 4.4.4.1 with 32 bytes of data:
    Reply from 4.4.4.1: bytes=32 time<1ms TTL=255
    Reply from 4.4.4.1: bytes=32 time<1ms TTL=255
    Reply from 4.4.4.1: bytes=32 time<1ms TTL=255
    Reply from 4.4.4.1: bytes=32 time<1ms TTL=255
    Ping statistics for 4.4.4.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 0ms, Average = 0ms
C:\>ping 2.2.2.2
    Pinging 2.2.2.2 with 32 bytes of data:
    Request timed out.
    Request timed out.
    Ping statistics for 2.2.2.2:
        Packets: Sent = 3, Received = 0, Lost = 3 (100% loss),
Control-C
^C
C:\>
    Укажем, что коммутатор должен маршрутизировать трафик
    3560 Switch0 -> CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#ip routing
Switch(config)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]

    PC-PT PC2 -> Desktop -> Command prompt
C:\>ping 2.2.2.2
    Pinging 2.2.2.2 with 32 bytes of data:
    Reply from 2.2.2.2: bytes=32 time<1ms TTL=127
    Reply from 2.2.2.2: bytes=32 time<1ms TTL=127
    Reply from 2.2.2.2: bytes=32 time<1ms TTL=127
    Reply from 2.2.2.2: bytes=32 time<1ms TTL=127
    Ping statistics for 2.2.2.2:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 0ms, Average = 0ms
Task:
Настроить статического агрегирования:
        На Switch0:
            int range fa0/1-2
            channel-group 1 mode on
        На Switch1:
            int range fa0/1-2
            channel-group 1 mode on
Decision:
    Switches->2960 switch0,1->End Devices->PC0,1->connetions->Copper Straight-Through->PC0(f0/1)-switch0(f0/3),PC1(f0/1)-switch1(f0/3)->switch0,1->CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#inter
Switch(config)#interface ran
Switch(config)#interface range fa0/1-2
Switch(config-if-range)#channel-gr
Switch(config-if-range)#channel-group 1 mod
Switch(config-if-range)#channel-group 1 mode ?
      active     Enable LACP unconditionally
      auto       Enable PAgP only if a PAgP device is detected
      desirable  Enable PAgP unconditionally
      on         Enable Etherchannel only
      passive    Enable LACP only if a LACP device is detected
Switch(config-if-range)#channel-group 1 mode on
Switch(config-if-range)#
    Creating a port-channel interface Port-channel 1
Switch(config-if-range)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]

    connetctions->copper cross-over switch0-switch1(f0/1,2)->PC0,1->Desktop->ip config->ip:192.168.1.1,2->Subnet:255.255.255.0

    PC1->Desktop->Command Prompt

C:\>ping 192.168.1.1
    Pinging 192.168.1.1 with 32 bytes of data:
    Reply from 192.168.1.1: bytes=32 time=12ms TTL=128
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.1: bytes=32 time=1ms TTL=128
    Reply from 192.168.1.1: bytes=32 time=11ms TTL=128
    Ping statistics for 192.168.1.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 12ms, Average = 6ms
Task:
Для проверки отказоустойчивости потушим одно соединение, например, fa0/2 на switch1 и восстановить связь
Decision:
    switch1->CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int fa0/2
Switch(config-if)#shutdown
Switch(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/2, changed state to administratively down
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to down
Switch(config-if)#no shut
Switch(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/2, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/2, changed state to up
Task:
В случае сущестования нескольких VLAN, для того чтобы создать trunkprot
Decision:
    Switch0-CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#inter
Switch(config)#interface po
Switch(config)#interface port-channel 1
Switch(config-if)#swti
Switch(config-if)#switc
Switch(config-if)#switchport mode tr
Switch(config-if)#switchport mode trunk
Switch(config-if)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]

    Switch1-CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#interface port-channel 1
Switch(config-if)#switchport mode trunk
Switch(config-if)#%SPANTREE-2-UNBLOCK_CONSIST_PORT: Unblocking Port-channel1 on VLAN0001. Port consistency restored.
    %SPANTREE-2-UNBLOCK_CONSIST_PORT: Unblocking Port-channel1 on VLAN0001. Port consistency restored.
Switch(config-if)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#show run
    Building configuration...
    Current configuration : 1225 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface Port-channel1
     switchport mode trunk
    !
    interface FastEthernet0/1
Task:
Настроить динамического агрегирования LACP:
        На Multilayer-Switch0:
            int range fa0/1-2
            channel-protocol lacp
            channel-group 1 mode active
            int range fa0/3-4
            channel-protocol lacp
            channel-group 2 mode active
            int range fa0/5-6
            channel-protocol lacp
            channel-group 3 mode active
        На Switch2, Switch3 и Switch4:
            int range fa0/1-2
            channel-protocol lacp
            channel-group 1 mode passive
Подключить каждый из коммутаторов 2мя портами к центральному коммутатору используя динамическое агрегирование
Decision:
    Switches->3560-24ps switch0->2960 switch2,3,4->connections->switch0-CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int ra
Switch(config)#int range fa0/1-2
Switch(config-if-range)#channel-pr
Switch(config-if-range)#channel-protocol ?
      lacp  Prepare interface for LACP protocol
      pagp  Prepare interface for PAgP protocol
Switch(config-if-range)#channel-protocol la
Switch(config-if-range)#channel-protocol lacp
Switch(config-if-range)#channel-gr
Switch(config-if-range)#channel-group 1 mode active
Switch(config-if-range)#
    Creating a port-channel interface Port-channel 1
Switch(config-if-range)#exit
Switch(config)#int range fa0/3-4
Switch(config-if-range)#channel-protocol lacp
Switch(config-if-range)#channel-group 2 mode active
Switch(config-if-range)#
    Creating a port-channel interface Port-channel 2
Switch(config-if-range)#exit
Switch(config)#int range fa0/5-6
Switch(config-if-range)#channel-protocol lacp
Switch(config-if-range)#channel-group 3 mode active
Switch(config-if-range)#
    Creating a port-channel interface Port-channel 3
Switch(config-if-range)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]

    switch2,3,4-CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int range fa0/1-2
Switch(config-if-range)#channel-prot
Switch(config-if-range)#channel-protocol la
Switch(config-if-range)#channel-protocol lacp
Switch(config-if-range)#channel-gr
Switch(config-if-range)#channel-group 1 mod
Switch(config-if-range)#channel-group 1 mode pas
Switch(config-if-range)#channel-group 1 mode passive
Switch(config-if-range)#
    Creating a port-channel interface Port-channel 1
Switch(config-if-range)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#wr mem
    Building configuration...
    [OK]

    coonections->copper straight-through->switch2(fa0/1,fa0/2)-switch0(fa0/1,fa0/2)->switch3(fa0/1,fa0/3)-switch0(fa0/2,fa0/4)->switch4(fa0/1,fa0/5)-switch0(fa0/2,fa0/6)

    switch0->CLI
Switch>en
Switch#show et
Switch#show etherchannel summ
Switch#show etherchannel summary
    Flags:  D - down        P - in port-channel
            I - stand-alone s - suspended
            H - Hot-standby (LACP only)
            R - Layer3      S - Layer2
            U - in use      f - failed to allocate aggregator
            u - unsuitable for bundling
            w - waiting to be aggregated
            d - default port
    Number of channel-groups in use: 3
    Number of aggregators:           3
    Group  Port-channel  Protocol    Ports
    ------+-------------+-----------+----------------------------------------------
    1      Po1(SU)           LACP   Fa0/1(P) Fa0/2(P)
    2      Po2(SU)           LACP   Fa0/3(P) Fa0/4(P)
    3      Po3(SU)           LACP   Fa0/5(P) Fa0/6(P)
Task:
Применение VLAN с использованием одного коммутатора
        Создаем VLAN
        Определяем Access порты
Пусть PC0,1 принадлежат одному сегменту бухгалтеров (синий) и PC2,3 - сегменту обычных пользователей (оранжевый). Нам нужно разделить трафик сегмента бухгалтерии от сегмента обычных пользователей.    
Decision:
    Switches->2960->End Devices->PC0,1,2,3->Connections->Copper Straight-Through (PC0,1,2,3-Switch2960)->Dram freeform->Fill color->Switch2960->CLI
Создадим VLAN
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 2
Switch(config-vlan)#name buh
Switch(config-vlan)#exit
Task:
Настроим интерфейс
Decision:
    Нам необходимо определить порты в созданный VLAN, для этого наведем на соединение  между PC0-Switch2960 - Fa0 и Fa0/1,2
Switch(config)#inter
Switch(config)#interface fastEthernet 0/1
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 2
Switch(config-if)#exit
Switch(config)#int fa0/2
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 2
Switch(config-if)#exit
Switch(config)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Task:
Проверим работу VLAN
Decision:
Switch#show vlan
    VLAN Name                             Status    Ports
    ---- -------------------------------- --------- -------------------------------
    1    default                          active    Fa0/3, Fa0/4, Fa0/5, Fa0/6
                                                    Fa0/7, Fa0/8, Fa0/9, Fa0/10
                                                    Fa0/11, Fa0/12, Fa0/13, Fa0/14
                                                    Fa0/15, Fa0/16, Fa0/17, Fa0/18
                                                    Fa0/19, Fa0/20, Fa0/21, Fa0/22
                                                    Fa0/23, Fa0/24, Gig0/1, Gig0/2
    2    buh                              active    Fa0/1, Fa0/2
    1002 fddi-default                     active
    1003 token-ring-default               active
    1004 fddinet-default                  active
    1005 trnet-default                    active
    VLAN Type  SAID       MTU   Parent RingNo BridgeNo Stp  BrdgMode Trans1 Trans2
    ---- ----- ---------- ----- ------ ------ -------- ---- -------- ------ ------
    1    enet  100001     1500  -      -      -        -    -        0      0
    2    enet  100002     1500  -      -      -        -    -        0      0
    1002 fddi  101002     1500  -      -      -        -    -        0      0
    1003 tr    101003     1500  -      -      -        -    -        0      0
    1004 fdnet 101004     1500  -      -      -        ieee -        0      0
    1005 trnet 101005     1500  -      -      -        ibm  -        0      0
Switch#show vlan brief
    VLAN Name                             Status    Ports
    ---- -------------------------------- --------- -------------------------------
    1    default                          active    Fa0/3, Fa0/4, Fa0/5, Fa0/6
                                                    Fa0/7, Fa0/8, Fa0/9, Fa0/10
                                                    Fa0/11, Fa0/12, Fa0/13, Fa0/14
                                                    Fa0/15, Fa0/16, Fa0/17, Fa0/18
                                                    Fa0/19, Fa0/20, Fa0/21, Fa0/22
                                                    Fa0/23, Fa0/24, Gig0/1, Gig0/2
    2    buh                              active    Fa0/1, Fa0/2
    1002 fddi-default                     active
    1003 token-ring-default               active
    1004 fddinet-default                  active
    1005 trnet-default                    active
Task:
Проделаем тоже самое для другого сегмента
Decision:
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 3
Switch(config-vlan)#name users
Switch(config-vlan)#exit
Switch(config)#int fa0/3
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 3
Switch(config-if)#exit
Switch(config)#int fa0/4
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 3
Switch(config-if)#exit
Switch(config)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#show vlan brief
    VLAN Name                             Status    Ports
    ---- -------------------------------- --------- -------------------------------
    1    default                          active    Fa0/5, Fa0/6, Fa0/7, Fa0/8
                                                    Fa0/9, Fa0/10, Fa0/11, Fa0/12
                                                    Fa0/13, Fa0/14, Fa0/15, Fa0/16
                                                    Fa0/17, Fa0/18, Fa0/19, Fa0/20
                                                    Fa0/21, Fa0/22, Fa0/23, Fa0/24
                                                    Gig0/1, Gig0/2
    2    buh                              active    Fa0/1, Fa0/2
    3    users                            active    Fa0/3, Fa0/4
    1002 fddi-default                     active
    1003 token-ring-default               active
    1004 fddinet-default                  active
    1005 trnet-default                    active
Task:
Зададим Ip адреса
Decision:
    PC0,1->Desktop->Ip configuration->Ip:192.168.2.1,2->Subnet Mask:255.255.255.0->PC2,3->Desktop->Ip configuration->Ip:192.168.3.1,2->Subnet Mask:255.255.255.0->PC0->Command Prompt
C:\>ping 192.168.2.2
    Pinging 192.168.2.2 with 32 bytes of data:
    Reply from 192.168.2.2: bytes=32 time=51ms TTL=128
    Reply from 192.168.2.2: bytes=32 time=31ms TTL=128
    Reply from 192.168.2.2: bytes=32 time=2ms TTL=128
    Reply from 192.168.2.2: bytes=32 time<1ms TTL=128
    Ping statistics for 192.168.2.2:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 51ms, Average = 21ms
C:\>ping 192.168.3.2
    Pinging 192.168.3.2 with 32 bytes of data:
    Request timed out.
    Request timed out.
    Request timed out.
    Request timed out.
    Ping statistics for 192.168.3.2:
        Packets: Sent = 4, Received = 0, Lost = 4 (100% loss),
Task:
В коммутаторе посмотрим таблицу mac адресов
Decision:
Switch#show mac address-table
              Mac Address Table
    -------------------------------------------
    Vlan    Mac Address       Type        Ports
    ----    -----------       --------    -----
       2    0050.0f9b.2696    DYNAMIC     Fa0/1
       2    00d0.588e.68d5    DYNAMIC     Fa0/2
       3    0090.2bb2.e04e    DYNAMIC     Fa0/3
       3    00e0.b0b5.976a    DYNAMIC     Fa0/4
Task:
Применение VLAN с двумя коммутаторами

        Создаем VLAN
        Определяем Access порты
        Определяем Trunk порты
Decision:
    Копируем из первой схемы и добавляем кабель->Соединение->Copper Cross-Over(GigabiteEthernet-Switch2960-Switch2960(1))->Поменяем Ip адреса: PC0(1),1(1)->Desktop->Ip configuration->Ip:192.168.2.3,4->Subnet Mask:255.255.255.0->PC2(1),3(1)->Desktop->Ip configuration->Ip:192.168.3.3,4->Subnet Mask:255.255.255.0->Объединяем сегменты компьютеров(желтый, зеленый)->Switch2960(1)->CLI
Switch>en
Switch#show run
    Building configuration...
    Current configuration : 1280 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface FastEthernet0/1
     switchport access vlan 2
     switchport mode access
    !
    interface FastEthernet0/2
     switchport access vlan 2
     switchport mode access
    !
    interface FastEthernet0/3
     switchport access vlan 3
     switchport mode access
    !
    interface FastEthernet0/4
     switchport access vlan 3
     switchport mode access
    !
    interface FastEthernet0/5
    !
    interface FastEthernet0/6
    !
    interface FastEthernet0/7
    !
    interface FastEthernet0/8
    !
Task:
Access порты настроены, нужно настроить Trunk порты.
Decision:
    Switch2960->CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int
Switch(config)#interface gig
Switch(config)#interface gigabitEthernet 1/1
    %Invalid interface type and number
Switch(config)#interface gigabitEthernet 0/1
Switch(config-if)#switch
Switch(config-if)#switchport mo
Switch(config-if)#switchport mode tr
Switch(config-if)#switchport mode trunk
Switch(config-if)#
    %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to down
    %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up
Switch(config-if)#
Task:
Указывваем VLAN, которые мы хотим передавать через наше физическое соединение
Decision:
Switch(config-if)#swit
Switch(config-if)#switchport tru
Switch(config-if)#switchport trunk all
Switch(config-if)#switchport trunk allowed vla
Switch(config-if)#switchport trunk allowed vlan 2,3
Switch(config-if)#end
Switch#wr mem
    Building configuration...
    [OK]

    Тоже самое сделаем на втором коммутаторе
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int
Switch(config)#interface gig
Switch(config)#interface gigabitEthernet 0/1
Switch(config-if)#swit
Switch(config-if)#switchport md
Switch(config-if)#switchport mod
Switch(config-if)#switchport mode tru
Switch(config-if)#switchport mode trunk
Switch(config-if)#swit
Switch(config-if)#switchport trun
Switch(config-if)#switchport trunk all
Switch(config-if)#switchport trunk allowed vla
Switch(config-if)#switchport trunk allowed vlan 2,3
Switch(config-if)#end
Switch#wr mem
    Building configuration...
    [OK]
Task:
Проверим взаимодействие данных компьютеров
Decision:
    PC0->Command Prompt->
C:\>ping 192.168.2.3
    Pinging 192.168.2.3 with 32 bytes of data:
    Reply from 192.168.2.3: bytes=32 time=67ms TTL=128
    Reply from 192.168.2.3: bytes=32 time<1ms TTL=128
    Reply from 192.168.2.3: bytes=32 time<1ms TTL=128
    Reply from 192.168.2.3: bytes=32 time<1ms TTL=128
    Ping statistics for 192.168.2.3:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 67ms, Average = 16ms
C:\>ping 192.168.2.4
    Pinging 192.168.2.4 with 32 bytes of data:
    Reply from 192.168.2.4: bytes=32 time=10ms TTL=128
    Reply from 192.168.2.4: bytes=32 time<1ms TTL=128
    Reply from 192.168.2.4: bytes=32 time=4ms TTL=128
    Reply from 192.168.2.4: bytes=32 time<1ms TTL=128
    Ping statistics for 192.168.2.4:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 10ms, Average = 3ms
C:\>ping 192.168.3.3
    Pinging 192.168.3.3 with 32 bytes of data:
    Request timed out.
    Request timed out.
    Request timed out.
    Request timed out.
    Ping statistics for 192.168.3.3:
        Packets: Sent = 4, Received = 0, Lost = 4 (100% loss),
Task:
Исключим из trunk порта vlan 3
Decision:
    Switch2960(1)->CLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#inter
Switch(config)#interface gi
Switch(config)#interface gigabitEthernet 0
Switch(config)#interface gigabitEthernet 0/1
Switch(config-if)#swit
Switch(config-if)#switchport tru
Switch(config-if)#switchport trunk vl
Switch(config-if)#switchport trunk vlan
Switch(config-if)#switchport trunk all
Switch(config-if)#switchport trunk allowed  vl
Switch(config-if)#switchport trunk allowed  vlan 2
Switch(config-if)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#show run
    Building configuration...
    Current configuration : 1336 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface FastEthernet0/1
     switchport access vlan 2
     switchport mode access
    !
    interface FastEthernet0/2
     switchport access vlan 2
     switchport mode access
    !
    interface FastEthernet0/3
     switchport access vlan 3
     switchport mode access
    !
    interface FastEthernet0/4
     switchport access vlan 3
     switchport mode access
    !
    interface FastEthernet0/5
    !
    interface FastEthernet0/6
    !
    interface FastEthernet0/7
    !
    interface FastEthernet0/8
    !
    interface FastEthernet0/9
    !
    interface FastEthernet0/10
    !
    interface FastEthernet0/11
    !
    interface FastEthernet0/12
    !
    interface FastEthernet0/13
    !
    interface FastEthernet0/14
    !
    interface FastEthernet0/15
    !
    interface FastEthernet0/16
    !
    interface FastEthernet0/17
    !
    interface FastEthernet0/18
    !
    interface FastEthernet0/19
    !
    interface FastEthernet0/20
    !
    interface FastEthernet0/21
    !
    interface FastEthernet0/22
    !
    interface FastEthernet0/23
    !
    interface FastEthernet0/24
    !
    interface GigabitEthernet0/1
     switchport trunk allowed vlan 2
     switchport mode trunk
    !
    interface GigabitEthernet0/2
    !
    interface Vlan1
     no ip address

    PC2->Command Prompt
C:\>ping 192.168.3.3
    Pinging 192.168.3.3 with 32 bytes of data:
    Request timed out.
    Request timed out.
    Request timed out.
    Ping statistics for 192.168.3.3:
        Packets: Sent = 4, Received = 0, Lost = 4 (100% loss),
    Control-C
    ^C
C:\>ping 192.168.3.4
    Pinging 192.168.3.4 with 32 bytes of data:
    Request timed out.
    Ping statistics for 192.168.3.4:
        Packets: Sent = 2, Received = 0, Lost = 2 (100% loss),
    Control-C
    ^C

    Switches->switch2960(switch0,1,2)->Connetctions->Automaticly->switch0,1,2->simulation->capture/forward

    realtime
Task:
Определить какой коммутатор является корневым(1)
Decision:
    switch2->SLI
Switch>en
Switch#show sp
Switch#show spanning-tree
    VLAN0001
      Spanning tree enabled protocol ieee
      Root ID    Priority    32769
                 Address     0001.6399.3513
                 This bridge is the root
                 Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
      Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
                 Address     0001.6399.3513
                 Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
                 Aging Time  20
    Interface        Role Sts Cost      Prio.Nbr Type
    ---------------- ---- --- --------- -------- --------------------------------
    Fa0/1            Desg FWD 19        128.1    P2p
    Fa0/2            Desg FWD 19        128.2    P2p

    switch0->SLI
Switch>en
Switch#show sp
Switch#show spanning-tree
    VLAN0001
      Spanning tree enabled protocol ieee
      Root ID    Priority    32769
                 Address     0001.6399.3513
                 Cost        19
                 Port        1(FastEthernet0/1)
                 Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
      Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
                 Address     0060.5CAD.DBAA
                 Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
                 Aging Time  20
    Interface        Role Sts Cost      Prio.Nbr Type
    ---------------- ---- --- --------- -------- --------------------------------
    Fa0/1            Root FWD 19        128.1    P2p
    Fa0/2            Desg FWD 19        128.2    P2p

    switch1->SLI
Switch>en
Switch#show spa
Switch#show spanning-tree
    VLAN0001
      Spanning tree enabled protocol ieee
      Root ID    Priority    32769
                 Address     0001.6399.3513
                 Cost        19
                 Port        1(FastEthernet0/1)
                 Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
      Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
                 Address     00D0.BC9C.9D4A
                 Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
                 Aging Time  20
    Interface        Role Sts Cost      Prio.Nbr Type
    ---------------- ---- --- --------- -------- --------------------------------
    Fa0/1            Root FWD 19        128.1    P2p
    Fa0/2            Altn BLK 19        128.2    P2p

    Проверим что протоккол STP работает и попробуем разорвать соединение

    switch0->SLI
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#inte
Switch(config)#interface et
Switch(config)#interface fa0/1
Switch(config-if)#shutd
Switch(config-if)#shutdown
Switch(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/1, changed state to administratively down
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down

    switch1->SLI
Switch#show spanning-tree
    VLAN0001
      Spanning tree enabled protocol ieee
      Root ID    Priority    32769
                 Address     0001.6399.3513
                 Cost        19
                 Port        1(FastEthernet0/1)
                 Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
      Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
                 Address     00D0.BC9C.9D4A
                 Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
                 Aging Time  20
    Interface        Role Sts Cost      Prio.Nbr Type
    ---------------- ---- --- --------- -------- --------------------------------
    Fa0/1            Root FWD 19        128.1    P2p
    Fa0/2            Desg FWD 19        128.2    P2p

Task:
Рассмотрим другой пример

    Switches->switch2960(switch3,4)->PC0,1->Connetctions->Automaticly->switch3,4-switch4,3-PC0-switch3-PC1-switch4
Decision:
    PC0,1->Desktop->ip configuration->ip->192.168.1.1,2->subnet mask->255.255.255.0->command prompt
C:\>ping 192.168.1.1
    Pinging 192.168.1.1 with 32 bytes of data:
    Reply from 192.168.1.1: bytes=32 time=11ms TTL=128
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Ping statistics for 192.168.1.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 11ms, Average = 2ms

    switch3->SLI
Switch>en
Switch#sho
Switch#show spa
Switch#show spanning-tree
VLAN0001
  Spanning tree enabled protocol ieee
  Root ID    Priority    32769
             Address     0000.0C42.5C20
             Cost        19
             Port        1(FastEthernet0/1)
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

  Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
             Address     00D0.BAA0.D34D
             Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
             Aging Time  20
Interface        Role Sts Cost      Prio.Nbr Type
---------------- ---- --- --------- -------- --------------------------------
Fa0/1            Root FWD 19        128.1    P2p
Fa0/3            Desg FWD 19        128.3    P2p
Fa0/2            Altn BLK 19        128.2    P2p

    switch4->SLI
Switch>en
Switch#show sp
Switch#show spanning-tree
    VLAN0001
      Spanning tree enabled protocol ieee
      Root ID    Priority    32769
                 Address     0000.0C42.5C20
                 This bridge is the root
                 Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec

      Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
                 Address     0000.0C42.5C20
                 Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
                 Aging Time  20
    Interface        Role Sts Cost      Prio.Nbr Type
    ---------------- ---- --- --------- -------- --------------------------------
    Fa0/1            Desg FWD 19        128.1    P2p
    Fa0/2            Desg FWD 19        128.2    P2p
    Fa0/3            Desg FWD 19        128.3    P2p
Task:
Попробуем разорвать соединение
Decision:
    PC1->Command Prompt
C:\>ping 192.168.1.1
    Pinging 192.168.1.1 with 32 bytes of data:
    Reply from 192.168.1.1: bytes=32 time=12ms TTL=128
    Reply from 192.168.1.1: bytes=32 time=1ms TTL=128
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.1: bytes=32 time=1ms TTL=128
    Ping statistics for 192.168.1.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 12ms, Average = 3ms

    switch4->SLI
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int fa
Switch(config)#int fastEthernet 0/1
Switch(config-if)#shut
Switch(config-if)#shutdown
Switch(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/1, changed state to administratively down
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down
Switch(config-if)# exit

    PC1->Command Prompt
C:\>ping 192.168.1.1
    Pinging 192.168.1.1 with 32 bytes of data:
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Ping statistics for 192.168.1.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 0ms, Average = 0ms
Task:
За 15-20 сек связь восстановилась, переключение на резервный канал. Отказоустойчивость это хорошо, но хотелось сократить время подобного переключения. Для этого нужен протокол RSTP.
Decision:
    switch4->SLI
Switch(config)#span
Switch(config)#spanning-tree mode rap
Switch(config)#spanning-tree mode rapid-pvst

    switch3->SLI
Switch>en
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#spa
Switch(config)#spanning-tree mode rap
Switch(config)#spanning-tree mode rapid-pvst
Switch(config)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#show sp
Switch#show spanning-tree
    VLAN0001
      Spanning tree enabled protocol rstp
      Root ID    Priority    32769
                 Address     0000.0C42.5C20
                 Cost        19
                 Port        2(FastEthernet0/2)
                 Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
      Bridge ID  Priority    32769  (priority 32768 sys-id-ext 1)
                 Address     00D0.BAA0.D34D
                 Hello Time  2 sec  Max Age 20 sec  Forward Delay 15 sec
                 Aging Time  20
    Interface        Role Sts Cost      Prio.Nbr Type
    ---------------- ---- --- --------- -------- --------------------------------
    Fa0/3            Desg FWD 19        128.3    P2p
    Fa0/2            Root FWD 19        128.2    P2p

    switch4->SLI
Switch(config)#int fa
Switch(config)#int fastEthernet 0/1
Switch(config-if)#no shu
Switch(config-if)#no shutdown
Switch(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/1, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to up

    PC1->Command Prompt
C:\>ping 192.168.1.1
    Pinging 192.168.1.1 with 32 bytes of data:
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.1: bytes=32 time=1ms TTL=128
    Ping statistics for 192.168.1.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 1ms, Average = 0ms

    switch4->SLI
Switch(config-if)#shutdown
Switch(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/1, changed state to administratively down
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/1, changed state to down

    PC1->Command Prompt
C:\>ping 192.168.1.1
    Pinging 192.168.1.1 with 32 bytes of data:
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.1: bytes=32 time=15ms TTL=128
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.1: bytes=32 time<1ms TTL=128
    Ping statistics for 192.168.1.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 15ms, Average = 3ms
Task:
Построим простейшую сеть
Decision:
$ packettracer

    end devices -> PC0 -> Switches -> 2960 -> connections -> console -> rs232-console -> PC0 -> Desktop -> terminal
Task:
Подключаемся по консоли
Decision:
Switch>?
    Exec commands:
      connect     Open a terminal connection
      disable     Turn off privileged commands
      disconnect  Disconnect an existing network connection
      enable      Turn on privileged commands
      exit        Exit from the EXEC
      logout      Exit from the EXEC
      ping        Send echo messages
      resume      Resume an active network connection
      show        Show running system information
      ssh         Open a secure shell client connection
      telnet      Open a telnet connection
      terminal    Set terminal line parameters
      traceroute  Trace route to destination
Switch>enable
Switch#disable
Switch>enable
Switch#show running-config
    Building configuration...
    Current configuration : 1080 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface FastEthernet0/1
    !
    interface FastEthernet0/2
Switch#show run
    Building configuration...
    Current configuration : 1080 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface FastEthernet0/1
    !
    interface FastEthernet0/2
    !
    interface FastEthernet0/3
    !
    interface FastEthernet0/4
    !
    interface FastEthernet0/5
    !
    interface FastEthernet0/6
    !
    interface FastEthernet0/7
    !
    interface FastEthernet0/8
    !
    interface FastEthernet0/9
    !
    interface FastEthernet0/10
    !
    interface FastEthernet0/11
    !
    interface FastEthernet0/12
    !
    interface FastEthernet0/13
    !
    interface FastEthernet0/14
    !
    interface FastEthernet0/15
    !
    interface FastEthernet0/16
    !
    interface FastEthernet0/17
    !
    interface FastEthernet0/18
    !
    interface FastEthernet0/19
    !
    interface FastEthernet0/20
    !
    interface FastEthernet0/21
    !
    interface FastEthernet0/22
    !
    interface FastEthernet0/23
    !
    interface FastEthernet0/24
    !
    interface GigabitEthernet0/1
    !
    interface GigabitEthernet0/2
    !
    interface Vlan1
     no ip address
     shutdown
    !
    !
    !
    !
    line con 0
    !
    line vty 0 4
     login
    line vty 5 15
     login
    !
    !
    !
    !
    end
Switch#configure terminal
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#exit
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Task:
Задаем пароль на привилегированный режим (enable)
Decision:
Switch(config)#enable password cisco
Switch(config)#exit
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#disable
Switch>enable
    Password:
Switch#show run
    Building configuration...
    Current configuration : 1104 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    enable password cisco
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface FastEthernet0/1
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#service passwor-e
Switch(config)#service passwor-en
Switch(config)#service passwor-ec
Switch(config)#service password
Switch(config)#service password-encryption
Switch(config)#exit
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#show run
    Building configuration...
    Current configuration : 1110 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    service password-encryption
    !
    hostname Switch
    !
    enable password 7 0822455D0A16
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface FastEthernet0/1
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#enable secret cisco2
Switch(config)#do show run
    Building configuration...
    Current configuration : 1157 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    service password-encryption
    !
    hostname Switch
    !
    enable secret 5 $1$mERr$yG9qv7LLYVv0YzwRYtdTM/
    enable password 7 0822455D0A16
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
Switch(config)#service password-encryption
Switch(config)#do show run
    Building configuration...
    Current configuration : 1157 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    service password-encryption
    !
    hostname Switch
    !
    enable secret 5 $1$mERr$yG9qv7LLYVv0YzwRYtdTM/
    enable password 7 0822455D0A16
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
Task:
Создаем пользователя
Decision:
Switch(config)#user
Switch(config)#username ?
      WORD  User name
Switch(config)#username admin ?
      password   Specify the password for the user
      privilege  Set user privilege level
      secret     Specify the secret for the user
      <cr>
Switch(config)#username admin pri
Switch(config)#username admin privilege ?
      <0-15>  User privilege level
Switch(config)#username admin privilege 15 ?
      password  Specify the password for the user
      secret    Specify the secret for the user
      <cr>
Switch(config)#username admin privilege 15 password cisco
Task:
Устанавливаем авторизацию на подключение к консоли
Decision:
Switch(config)#line ?
      <0-16>   First Line number
      console  Primary terminal line
      vty      Virtual terminal
Switch(config)#line co
Switch(config)#line console ?
      <0-0>  First Line number
Switch(config)#line console 0
Switch(config-line)#?
    Line configuration commands:
      access-class  Filter connections based on an IP access list
      accounting    Accounting parameters
      databits      Set number of data bits per character
      default       Set a command to its defaults
      exec-timeout  Set the EXEC timeout
      exit          Exit from line configuration mode
      flowcontrol   Set the flow control
      history       Enable and control the command history function
      logging       Modify message logging facilities
      login         Enable password checking
      motd-banner   Enable the display of the MOTD banner
      no            Negate a command or set its defaults
      parity        Set terminal parity
      password      Set a password
      privilege     Change privilege level for line
      speed         Set the transmit and receive speeds
      stopbits      Set async line stop bits
      transport     Define transport protocols for line
Switch(config-line)#login ?
      authentication  authenticate using aaa method list
      local           Local password checking
      <cr>
Switch(config-line)#login local
Switch(config-line)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Task:
Задаем IP-адрес устройства
Decision:
Switch#show run
    Building configuration...
    Current configuration : 1224 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    service password-encryption
    !
    hostname Switch
    !
    enable secret 5 $1$mERr$yG9qv7LLYVv0YzwRYtdTM/
    enable password 7 0822455D0A16
    !
    !
    !
    !
    username admin privilege 15 password 7 0822455D0A16
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface FastEthernet0/1
    !
    interface FastEthernet0/2
    !
    interface FastEthernet0/3
    !
    interface FastEthernet0/4
    !
    interface FastEthernet0/5
    !
    interface FastEthernet0/6
    !
    interface FastEthernet0/7
    !
    interface FastEthernet0/8
    !
    interface FastEthernet0/9
    !
    interface FastEthernet0/10
    !
    interface FastEthernet0/11
    !
    interface FastEthernet0/12
    !
    interface FastEthernet0/13
    !
    interface FastEthernet0/14
    !
    interface FastEthernet0/15
    !
    interface FastEthernet0/16
    !
    interface FastEthernet0/17
    !
    interface FastEthernet0/18
    !
    interface FastEthernet0/19
    !
    interface FastEthernet0/20
    !
    interface FastEthernet0/21
    !
    interface FastEthernet0/22
    !
    interface FastEthernet0/23
    !
    interface FastEthernet0/24
    !
    interface GigabitEthernet0/1
    !
    interface GigabitEthernet0/2
    !
    interface Vlan1
     no ip address
     shutdown
    !
    !
    !
    !
    line con 0
     login local
    !
    line vty 0 4
     login
    line vty 5 15
     login
    !
    !
    !
    !
    end
Switch#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#inter
Switch(config)#interface Vlan1
Switch(config-if)#?
    Interface configuration commands:
      arp          Set arp type (arpa, probe, snap) or timeout
      description  Interface specific description
      exit         Exit from interface configuration mode
      ip           Interface Internet Protocol config commands
      no           Negate a command or set its defaults
      shutdown     Shutdown the selected interface
      standby      HSRP interface configuration commands
Switch(config-if)#ip ?
      address         Set the IP address of an interface
      helper-address  Specify a destination address for UDP broadcasts
Switch(config-if)#ip add
Switch(config-if)#ip address 192.168.0.1 255.255.255.0
Switch(config-if)#no shu
Switch(config-if)#no shutdown
Switch(config-if)#
    %LINK-5-CHANGED: Interface Vlan1, changed state to up
Switch(config-if)#exit
Task:
Выбираем тип удаленного подключения (Telnet/SSH)
Decision:
Switch(config)#line ?
      <0-16>   First Line number
      console  Primary terminal line
      vty      Virtual terminal
Switch(config)#line vt
Switch(config)#line vty ?
      <0-15>  First Line number
Switch(config)#line vty 0 4
Switch(config-line)#?
    Virtual Line configuration commands:
      access-class  Filter connections based on an IP access list
      accounting    Accounting parameters
      databits      Set number of data bits per character
      exec-timeout  Set the EXEC timeout
      exit          Exit from line configuration mode
      flowcontrol   Set the flow control
      history       Enable and control the command history function
      logging       Modify message logging facilities
      login         Enable password checking
      motd-banner   Enable the display of the MOTD banner
      no            Negate a command or set its defaults
      parity        Set terminal parity
      password      Set a password
      privilege     Change privilege level for line
      speed         Set the transmit and receive speeds
      stopbits      Set async line stop bits
      transport     Define transport protocols for line
Switch(config-line)#transport ?
      input   Define which protocols to use when connecting to the terminal server
      output  Define which protocols to use for outgoing connections
Switch(config-line)#transport in
Switch(config-line)#transport input ?
      all     All protocols
      none    No protocols
      ssh     TCP/IP SSH protocol
      telnet  TCP/IP Telnet protocol
Switch(config-line)#transport input telnet
Task:
Включаем авторизацию для удаленных подключений
Decision:
Switch(config-line)#login ?
      authentication  authenticate using aaa method list
      local           Local password checking
      <cr>
Switch(config-line)#login local
Switch(config-line)#end
Switch#
    %SYS-5-CONFIG_I: Configured from console by console
Switch#write memory
    Building configuration...
    [OK]

    connections -> copper straight-throught -> PC0-Switch -> PC0 -> Desktop -> IP configuration -> ipv4 - 192.168.0.2 -> subnet mask - 255.255.255.0 -> command prompt ->
C:\>ping 192.168.0.1
    Pinging 192.168.0.1 with 32 bytes of data
    Request timed out.
    Reply from 192.168.0.1: bytes=32 time<1ms TTL=255
    Reply from 192.168.0.1: bytes=32 time<1ms TTL=255
    Reply from 192.168.0.1: bytes=32 time=5ms TTL=255
    Ping statistics for 192.168.0.1:
        Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 5ms, Average = 1ms
C:\>ping 192.168.0.1
    Pinging 192.168.0.1 with 32 bytes of data:
    Reply from 192.168.0.1: bytes=32 time<1ms TTL=255
    Reply from 192.168.0.1: bytes=32 time<1ms TTL=255
    Reply from 192.168.0.1: bytes=32 time<1ms TTL=255
    Reply from 192.168.0.1: bytes=32 time<1ms TTL=255
    Ping statistics for 192.168.0.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 0ms, Average = 0ms
C:\>telnet 192.168.0.1
    Trying 192.168.0.1 ...Open
    User Access Verification
    Username: Admin
    Password:
Switch#
Task:
Коммутатор
Decision:
$ packettracer

    end devices -> PC4,5,6,7 -> Desktop -> ip configuration -> ipv4 - 192.168.1.2,3,4,5 -> subnet mask - 255.255.255.0 -> Switches -> 2960 -> connections -> copper straight-throuht ->
C:\>ping 192.168.1.3
    Pinging 192.168.1.3 with 32 bytes of data:
    Reply from 192.168.1.3: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.3: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.3: bytes=32 time=3ms TTL=128
    Reply from 192.168.1.3: bytes=32 time=12ms TTL=128
    Ping statistics for 192.168.1.3:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 12ms, Average = 3

    Hubs -> PT Hub -> Connections -> скопируем PC4,5,6,7
C:\>ping 192.168.1.3
    Pinging 192.168.1.3 with 32 bytes of data:
    Reply from 192.168.1.3: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.3: bytes=32 time=1ms TTL=128
    Reply from 192.168.1.3: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.3: bytes=32 time=1ms TTL=128
    Ping statistics for 192.168.1.3:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 1ms, Average = 0ms
C:\>ping 192.168.1.4
    Pinging 192.168.1.4 with 32 bytes of data:
    Reply from 192.168.1.4: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.4: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.4: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.4: bytes=32 time=1ms TTL=128
    Ping statistics for 192.168.1.4:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 1ms, Average = 0ms
C:\>ping 192.168.1.5
    Pinging 192.168.1.5 with 32 bytes of data:
    Reply from 192.168.1.5: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.5: bytes=32 time=1ms TTL=128
    Reply from 192.168.1.5: bytes=32 time<1ms TTL=128
    Reply from 192.168.1.5: bytes=32 time<1ms TTL=128
    Ping statistics for 192.168.1.5:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 1ms, Average = 0ms

    add simple pdu -> PC4-PC7, PC4(1)-PC7(1) -> Simulation
Task:
Используем DHCP-протокол через маршрутизатор: We have one switch and router and several computers, Create a DHCP pool (some kind of ip address space), Exclude certain ip addresses, Настроить компьютеры (Убедимся, что ip адреса автоматически добавляются), Проверить связь, See which computers and which ip addresses were issued, Настроим порты, задать VLAN 2,3 на порты fa0/1,2,3,4, The vlan needs to be pushed to the router, Configure the router's sub-interface for 2,3,4 vlans, Configure the DHCP Server. The Dhcp server is located in a separate segment and a broadcast request from computers 3,4,5,6 in the search for a Dhcp server, the router will not pass. Since the computers are in different segments. It is necessary to forward computer requests to the Dhcp server
Decision:
Switch -2960 - PC0 - PC1 - PC2 - Router0 - 1841 - Copper Straight-Through - Router0 - CLI
Router>en
Router#conf t
    Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#int fa0/0
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
Router(config-if)#ip add
Router(config-if)#ip address 192.168.1.1 255.255.255.0
Router(config-if)#exit
Router(config)#ip dhcp pool DHCP
Router(dhcp-config)#network 192.168.1.0 255.255.255.0
Router(dhcp-config)#defa
Router(dhcp-config)#default-router 192.168.1.1
Router(dhcp-config)#dns-server 8.8.8.8
Router(dhcp-config)#exit
Router(config)#ip dhcp  excluded-address 192.168.1.100
Router(config)#ip dhcp  excluded-address 192.168.1.1
Router(config)#exit
Router#wr mem
PC0,1,2 - Desktop - ip configuration - +DHCP - PC0 - Desktop - command prompt
C:\>ping 192.168.1.1
...
Ping statistics for 192.168.1.1:
	Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
	Minimum = 0ms, Maximum = 11ms, Average = 2ms
C:\>ping 192.168.1.3
...
Ping statistics for 192.168.1.3:
	Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
	Minimum = 0ms, Maximum = 1ms, Average = 0ms
C:\>ping 192.168.1.4
...
Ping statistics for 192.168.1.4:
	Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
	Minimum = 0ms, Maximum = 0ms, Average = 0ms
Router0 - CLI
Router#show ip dhcp binding
IP address       Client-ID/              Lease expiration        Type
                Hardware address
192.168.1.2      0090.21EC.999A           --                     Automatic
192.168.1.3      0060.3E23.49DD           --                     Automatic
192.168.1.4      0010.1109.2ACD           --                     Automatic
Task:
Используем DHCP-протокол через сервер: We have 3 different network segments (Vlan2,3,4) and a dedicated dhcp server, Segmenting our network, Create a VLAN, 
Decision:
Switch - 2960 - PC3,4,5 - Router1 - 1841 - Sever0 - Copper Straight-Through - switch1 - cli
Switch>en
Switch#conf t
Switch(config)#vlan 2
Switch(config-vlan)#name VLAN2
Switch(config-vlan)#exit
Switch(config)#vlan 3
Switch(config-vlan)#name VLAN3
Switch(config-vlan)#exit
Switch(config)#vlan 4
Switch(config-vlan)#name DHCP
Switch(config-vlan)#exit
Switch(config)#int range fa
Switch(config)#int range fastEthernet 0/1-2
Switch(config-if-range)#swi
Switch(config-if-range)#switchport mode
Switch(config-if-range)#switchport mode acc
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#swi
Switch(config-if-range)#switchport acc
Switch(config-if-range)#switchport access vla
Switch(config-if-range)#switchport access vlan 2
Switch(config-if-range)#exit
Switch(config)#int range fastEthernet 0/3-4
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 3
Switch(config-if-range)#exit
Switch(config)#int range fastEthernet 0/5
Switch(config-if-range)#switchport mode access
Switch(config-if-range)#switchport access vlan 4
Switch(config-if-range)#exit
Switch(config)#int fa
Switch(config)#int fastEthernet 0/6
Switch(config-if)#switchport mode trunk
Switch(config-if)#swi
Switch(config-if)#switchport tr
Switch(config-if)#switchport trunk all
Switch(config-if)#switchport trunk allowed vla
Switch(config-if)#switchport trunk allowed vlan 2,3,4
Switch(config-if)#exit
Switch(config)#end
Switch#wr mem
Switch#show run
    Building configuration...
    Current configuration : 1388 bytes
    !
    version 15.0
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface FastEthernet0/1
     switchport access vlan 2
     switchport mode access
    !
    interface FastEthernet0/2
     switchport access vlan 2
     switchport mode access
    !
    interface FastEthernet0/3
     switchport access vlan 3
     switchport mode access
    !
    interface FastEthernet0/4
     switchport access vlan 3
     switchport mode access
    !
    interface FastEthernet0/5
     switchport access vlan 4
     switchport mode access
    !
    interface FastEthernet0/6
     switchport trunk allowed vlan 2-4
     switchport mode trunk
router1 - cli
Router>en
Router#conf t
Router(config)#int g
Router(config)#int gigabitEthernet 0/0.2
Router(config-subif)#enc
Router(config-subif)#encapsulation do
Router(config-subif)#encapsulation dot1Q 2
Router(config-subif)#ip
Router(config-subif)#ip add
Router(config-subif)#ip address 192.168.2.1 255.255.255.0
Router(config-subif)#no sh
Router(config-subif)#no shutdown
Router(config-subif)#exit
Router(config)#int gigabitEthernet 0/0
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0, changed state to up
    %LINK-5-CHANGED: Interface GigabitEthernet0/0.2, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.2, changed state to up
Router(config-if)#exit
Router(config)#int gigabitEthernet 0/0.3
Router(config-subif)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/0.3, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.3, changed state to up
Router(config-subif)#encapsulation dot1Q 3
Router(config-subif)#ip address 192.168.3.1 255.255.255.0
Router(config-subif)#no shutdown
Router(config-subif)#exit
Router(config)#int gigabitEthernet 0/0.4
Router(config-subif)#
    %LINK-5-CHANGED: Interface GigabitEthernet0/0.4, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/0.4, changed state to up
Router(config-subif)#encapsulation dot1Q 4
Router(config-subif)#ip address 192.168.4.1 255.255.255.0
Router(config-subif)#no shutdown
Router(config-subif)#end
Router#
Router#wr mem
Router#show run
    Building configuration...
    Current configuration : 882 bytes
    !
    version 15.1
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Router
    !
    !
    !
    !
    !
    !
    !
    !
    ip cef
    no ipv6 cef
    !
    !
    !
    !
    license udi pid CISCO2901/K9 sn FTX1524I7AI-
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    !
    !
    !
    !
    !
    !
    interface GigabitEthernet0/0
     no ip address
     duplex auto
     speed auto
    !
    interface GigabitEthernet0/0.2
     encapsulation dot1Q 2
     ip address 192.168.2.1 255.255.255.0
    !
    interface GigabitEthernet0/0.3
     encapsulation dot1Q 3
     ip address 192.168.3.1 255.255.255.0
    !
    interface GigabitEthernet0/0.4
     encapsulation dot1Q 4
     ip address 192.168.4.1 255.255.255.0
    !
    interface GigabitEthernet0/1
     no ip address
     duplex auto
     speed auto
     shutdown
    !
server0 - dekstop - ip configuration - ip address 192.168.4.2 - subnet mask 255.255.255.0 - default gateway 192.168.4.1 - command prompt
C:\>ping 192.168.4.1
    ...
    Ping statistics for 192.168.4.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 6ms, Average = 1ms
    services - dhcp - убеждаемся, что видим один дефолтный server pool - pool name DCHP-VLAN2 - start ip address 192.168.2.0 - default gateway 192.168.2.1 - dns server - 8.8.8.8 - service +On - Add - тоже самое для 3тьего vlan
Router1 - ClI
Router>en
Router#conf t
Router(config)#int g
Router(config)#int gigabitEthernet 0/0.2
Router(config-subif)#ip hel
Router(config-subif)#ip help
Router(config-subif)#ip helper-address 192.168.4.2
Router(config-subif)#exit
Router(config)#int gigabitEthernet 0/0.3
Router(config-subif)#ip helper-address 192.168.4.2
Router(config-subif)#end
Router#wr mem
PC3,4,5,6 - desktop - ip configuration - +dhcp - Убеждаемтся в том, что dhcp автоматически раздал адреса - PC6 - command prompt
C:\>ping 192.168.3.1
    ...
    Ping statistics for 192.168.3.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 2ms, Average = 1ms
C:\>ping 192.168.2.2
    ...
    Ping statistics for 192.168.2.2:
        Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 1ms, Average = 0ms
Task:
Wifi: setting up a Wi fi router, Add a custom device laptop, add another stationary computer. assume that the organization already has some kind of network. we need to deploy wi-fi to our organization. we have a guest room of the organization. make sure that the wi-fi network is in a separate segment. On the port that connects to our router1 router, you need to add this vlan4 to trunkport. We need to create a sub interface on our router. Set the possibility to distribute addresses. Add some kind of wireless device, that is, let's assume that a client of the organization came to us and he has a laptop that wants to connect to wifi. Что получить ноутбуку ip адрес wifi нужно определить точку доступа к vlan.
Необходимо донастроить nat.    
Decision:
Router0-CLI
Router>en
Router#conf t
Router(config)#int fa
Router(config)#int fastEthernet 0/0
Router(config-if)#ip add
Router(config-if)#ip address 210.210.0.1 255.255.255.252
Router(config-if)#no sh
Router(config-if)#no shutdown
Router(config-if)#
    %LINK-5-CHANGED: Interface FastEthernet0/0, changed state to up
    %LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/0, changed state to up
Router(config-if)#end
Router#wr mem
Wireless router 0 - gui - static ip - ip address: 210.210.0.2 - subnet mask: 255.255.255.252 - gateway: 210.210.0.1 - save setting - wireless - network name ssid: netskills-home - save setting - wireless security - wpa2 personal - passphase: ciscocisco - save setting
lalptop0 - выключаем - убираем (перетаскиваем) подключенный сетевой модуль - заместо него wrc300n - включаем ноутбук - desktop - pc wireless - connect - refresh - netskills-home - connect - pre-shared key - ciscocisco - command promprt
C:\>ipconfig
    Bluetooth Connection:(default port)
       Connection-specific DNS Suffix..:
       Link-local IPv6 Address.........: ::
       IPv6 Address....................: ::
       IPv4 Address....................: 0.0.0.0
       Subnet Mask.....................: 0.0.0.0
       Default Gateway.................: ::
                                         0.0.0.0
    Wireless0 Connection:
       Connection-specific DNS Suffix..:
       Link-local IPv6 Address.........: FE80::202:4AFF:FE66:D186
       IPv6 Address....................: ::
       IPv4 Address....................: 192.168.0.100
       Subnet Mask.....................: 255.255.255.0
       Default Gateway.................: ::
                                         192.168.0.1
C:\>ping 192.168.0.1
    ...
    Ping statistics for 192.168.0.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 23ms, Maximum = 122ms, Average = 56ms
C:\>ping 210.210.0.1
    ...
    Ping statistics for 210.210.0.1:
        Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 17ms, Maximum = 32ms, Average = 26ms
pc0 - ip conf - dbhcp - command prompt
C:\>ping 192.168.0.1
    ...
    Ping statistics for 192.168.0.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 1ms, Average = 0ms
C:\>ping 210.210.0.1
    ...
    Ping statistics for 210.210.0.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 0ms, Maximum = 1ms, Average = 0ms
C:\>ping 192.168.0.100
    ...
    Ping statistics for 192.168.0.100:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 11ms, Maximum = 158ms, Average = 62ms
Switch0 - CLI
Switch>en
Switch#show run
    Building configuration...
    Current configuration : 1436 bytes
    !
    version 12.2
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface FastEthernet0/1
     description ToRouter
     switchport trunk allowed vlan 2-4
     switchport mode trunk
    !
    interface FastEthernet0/2
     description Users
     switchport access vlan 2
     switchport mode access
    !
    interface FastEthernet0/3
     description Users
     switchport access vlan 2
     switchport mode access
    !
    interface FastEthernet0/4
     description srv
     switchport access vlan 3
     switchport mode access
    !
    interface FastEthernet0/5
     description WiFi-AP
     switchport access vlan 4
     switchport mode access
    !
    interface FastEthernet0/6
    !

    router1-cli
Switch>en
Switch#show run
    Building configuration...
    Current configuration : 1436 bytes
    !
    version 12.2
    no service timestamps log datetime msec
    no service timestamps debug datetime msec
    no service password-encryption
    !
    hostname Switch
    !
    !
    !
    !
    !
    !
    spanning-tree mode pvst
    spanning-tree extend system-id
    !
    interface FastEthernet0/1
     description ToRouter
     switchport trunk allowed vlan 2-4
     switchport mode trunk
    !
    interface FastEthernet0/2
     description Users
     switchport access vlan 2
     switchport mode access
    !
    interface FastEthernet0/3
     description Users
     switchport access vlan 2
     switchport mode access
    !
    interface FastEthernet0/4
     description srv
     switchport access vlan 3
     switchport mode access
    !
    interface FastEthernet0/5
     description WiFi-AP
     switchport access vlan 4
     switchport mode access
    !
    interface FastEthernet0/6
    !
access point0 - config - port1 - ssid: netskill - wpa2-psk - pass phrase: ciscocisco
switch-cli
#en
# conf t
# vlan 4
# name wifi
# end
#show run
    ...
    switchport trunk allowed vlan 2-4
router1 - cli
#en
# conf t
# int fa0/1.4
# encapsulation dot1Q 4
# ip address 192.168.4.1 255.255.255.0
# no shutdown
# end
# conf t
# ip dhcp pool Wifi-pool
# network 192.168.4.0 255.255.255.0
# default-router 192.168.4.1
# exit
# ip dhcp excluded-address 192.168.4.1
# end
# wr mem
Laptop1 - выключаем - убираем (перетаскиваем) подключенный сетевой модуль - заместо него wrc300n - включаем ноутбук - desktop - pc wireless - connect - refresh - netskills - save setting - wireless security - wpa2 personal - passphase: ciscocisco - save setting - command prompt
switch0-cli
#en
# conf t
# switchport mode access
# switchport access vlan 4
# description WiFi-AP
# end
# wr mem
Router1-cli
# en
# conf t
# ip access-list standart FOR-NAT
# permit 192.168.4.0  0.0.0.255
# exit
# int fa0/1.4
# ip nat inside
# end
# wr mem
lalptop1 - ip configuration - dhcp - ok - command prompt
C:\>ipconfig
    Bluetooth Connection:(default port)
       Connection-specific DNS Suffix..:
       Link-local IPv6 Address.........: ::
       IPv6 Address....................: ::
       IPv4 Address....................: 0.0.0.0
       Subnet Mask.....................: 0.0.0.0
       Default Gateway.................: ::
                                         0.0.0.0
    Wireless0 Connection:
       Connection-specific DNS Suffix..:
       Link-local IPv6 Address.........: FE80::203:E4FF:FE34:D1E7
       IPv6 Address....................: ::
       IPv4 Address....................: 192.168.4.2
       Subnet Mask.....................: 255.255.255.0
       Default Gateway.................: ::
                                         192.168.4.1
C:\>ping 192.168.4.1
    ...
    Ping statistics for 192.168.4.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 48ms, Maximum = 171ms, Average = 96ms
C:\>ping 192.168.2.3
    ...
    Ping statistics for 192.168.2.3:
        Packets: Sent = 4, Received = 3, Lost = 1 (25% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 27ms, Maximum = 60ms, Average = 39ms
C:\>ping 210.210.0.1
    ...
    Ping statistics for 210.210.0.1:
        Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
    Approximate round trip times in milli-seconds:
        Minimum = 38ms, Maximum = 69ms, Average = 52ms
Source:
https://www.youtube.com/playlist?list=PLcDkQ2Au8aVNYsqGsxRQxYyQijILa94T9
